{"vendors": [{"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/14bdoking", "tagline": "My name is 14bdoking and i'm here to serve you! I have the purest BDO you'll find domestically in the USA.", "details": "Hello! My name is 14bdoking and I am your source for the purest 1,4 Butanediol you can get domestically in the USA. I am very passionate about this line of work and am dedicated to being the best vendor I can be. I hope you enjoy my product! Happy shopping!", "policy": "No reships if pack seized.\r\nNo reships if  pack says delivered on tracking.\r\nNo expedited shipping.\r\nNo refunds.\r\nNo reships if you send me the wrong address.\r\nPLEASE GET YOUR ADDRESS RIGHT THE FIRST TIME.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_6WCAkcD.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/AbsolutBuds", "tagline": "UK cannabis vendor | Top quality products only! | we ship to EU", "details": "AbsolutBuds \r\n\r\nWelcome to our online store.\r\n\r\nWe specialize in Top Quality Cannabis Products.\r\n\r\n- Premium disposable Vapes\r\n- Top Quality Edibles\r\n- Top shelf bud\r\n\r\n\r\nTest our product and service. Experience it for yourself.\r\n\r\n- Top quality product.\r\n\r\n- Excellent Stealth.\r\n\r\n- Professional Service.\r\n\r\n***Honest reviews welcomed/encouraged***\r\n\r\n\r\n===============================", "policy": "SHIPPING AND DELIVERY.\r\n\r\nAll items sent via Royal Mail.\r\n\r\nUK | 1-3 days*\r\n\r\nEU | 7-14 days*\r\n\r\n\r\norder by 2pm for same day shipping.\r\n\r\n*average delivery times, may take longer depending on your local Royal Mail/postal services.\r\n\r\n===================================\r\n\r\nREFUND POLICY.\r\n\r\nRefunds processed on a case by case basis.\r\n\r\nPlease message us if there are any problems.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["GB"], "ships_to": ["AL", "AT", "BE", "BG", "CH", "CY", "DE", "DK", "EE", "ES", "FI", "FR", "GB", "GG", "GR", "HR", "HU", "IE", "IM", "IS", "IT", "JE", "LT", "LU", "LV", "NL", "NO", "PL", "PT", "RO", "SE", "SI", "SK", "SM"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Asfaleia_Security_Consulting", "tagline": "Security first, not last - it is not retrospective!", "details": "We are a distributed group of Security specialists that offer consulting in OpSec, Counterintelligence, to the ones that need it. Be it large organizations, single dark water sailors or anything in between.\r\n\r\nWe are working in Zero-Knowledge, Zero-Trust setup. We don't need to know any details of your operation to help you become tough and resistant even in the harshest environments. We teach you about deception techniques, psychological training to withstand the pressure without breaking your knees, how to get aware about possible compromise, how to find rats and how to win the battles and the war.\r\n\r\n***************************************************\r\nWe cover in our consulting all areas related to the operation :\r\n\r\n- Preparation phase, project planning, before the operation starts. Remember that the mistakes you do here can break your neck later on. We help you to make it right from the very beginning. Your OpSec training and setup needs to be ready in this phase, not later. The ones that didn't get it right before are in jail now. \r\n\r\n- Management phase, managing the operation. This includes everything from Zero-Knowledge Zero-Trust Controlling services if needed through personnel training and management, to Value Stream Mapping, Business Continuity Planning and similar services. Whatever you need to manage your Operation efficiently and securely, having clear overview and in-depth knowledge for your decision making.\r\n\r\n- Operation liquidation, project ending, disappearance, post-operation plans or contingency planning. \r\n***************************************************\r\n\r\nGet in touch with us and we can make you battle ready. First consulting (chat only, no audio or video), where you get an idea what we offer and what you can get out of it, is free. Take the chance and stay safe and successful before, during as well as after the operation ends.", "policy": "We are offering live consulting here and therefore cannot guaranty the money return after you got the information. We are quite confident that the guidance and care you get from us is very difficult to find elsewhere. After all those long years of experience in very harsh conditions, we know precisely what clients need.\r\n\r\nOn the other side if you are not satisfied, we can agree somehow and make a reasonable balance.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": [], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Avbeaau", "tagline": "", "details": "Who we are?\r\n\r\nAvbeaAU is Coming to Drugula Market with high standards of quality and service to cater for our customers needs making shopping online as efficient as can be.\r\n\r\nWe offer very high quality Methamphetamine shards very pure ice shards made with Ephedrine straight from the source, clean and no cuts you will be amazed by this crystal meth quality at this low price.\r\n\r\n❤️ Secure shipping in Australia.\r\n\r\n❤️ Professional packaging and stealth.\r\n\r\n❤️ Only the highest quality products\r\n\r\n❤️ Friendly customer support\r\n\r\nWe take pride in selling on the highest quality drugs and shipping them in a secure and fast way. We always ship all orders from Australia with Australia Post.\r\n\r\n██████████████████████████████\r\n\r\nWhy choose AvbeaAU as your vendor?\r\n✅ Only the best and tested products.\r\n✅ 100% Escrow listings.\r\n✅ Fair and Easy reship policy.\r\n✅ Friendly and fast customer support.\r\n✅ High discounts for Bulk customers.\r\n✅ Shipping to AU states only!\r\n✅ Professional Stealth and packaging.\r\n\r\n██████████████████████████████\r\n\r\nSTEALTH & PACKAGING\r\nAll orders are vacuum sealed (Mylar layer). Every layer is cleaned with Alcohol so no residue or smell is left behind. If you as buyer have any special stealth needs please contact us so we can discuss them.\r\n\r\n██████████████████████████████\r\n\r\nSHIPPING TIMES & TRANSIT\r\nAll orders are ALWAYS shipped from AUSTRALIA. We take great care in packing and shipping your order in the safest ways possible, so please allow us 12-48 hours to ship your order starting from the moment we mark it shipped.\r\n\r\nFor security reasons we only ship to AUS (no acceptations made). We have a very high success rate (98%+) for delivery and it a very low risk of seizure or profiling of our packages. That's why it is safer for us and our customers to ship only within Australia.\r\n\r\nOur cutting time is 16:00 from Monday to Friday. All orders placed after 16:00 are delivered the next day. They are not delivered on Saturday and Sunday. Usually, express delivery arrives in 1-3 days. it will take 4-7 days in very unusual cases. Please wait patiently. Thank you so much.\r\n\r\nDue to security concerns, we do not release tracking number immediately after dispatch, and are only released upon request after 3 business days.\r\n\r\n████████████████████████████████\r\n\r\nADDRESS & PGP\r\nWhen ordering please provide your address in a way that we can copy and paste it! Using the following address format:\r\n\r\nHarrison Smith\r\n17 Some Street\r\nCarlton VIC 3053\r\n\r\n███████████████████████████████\r\n\r\nFINALISING & FEEDBACK\r\nPlease always finalise your order as soon as you receive it . It's very important that you finalise your order as fast as possible so the funds are released to us once you receive your package this helps us reduce the risk of loosing a lot of money in case of a market failure or exit scam. we simply cannot afford too large of an escrow due to the nature of dark net.\r\n\r\n██████████████████████████████\r\n\r\nORDER WITH CONFIDENCE\r\nIf you are not happy with the product you received or you did not receive your order, please before writing NEGATIVE FEEDBACK contact us first to find a solution, If you fail to do this and write negative feedback before contacting us and giving us enough time to solve the problem, you will loose the right to any reship or refund. We are always willing to find a good solution for the both of us, so stay friendly polite and have a bit of patience while we try to help you!\r\n\r\n██████████████████████████████\r\n\r\nTERMS & CONDITIONS\r\nWe only sale the best in the market if there are any issues with the quality of the product please let us know ASAP.\r\n\r\nWe are not petty we are NOT in the business in scamming your hard earned money but we ask our customers to be fair too.\r\n\r\nMost importantly we ask all our customers to use any of our products responsibly.\r\n\r\n++++++PRODUCT++++++\r\n\r\nNote: As mentioned above the product is always tested before distribution and that is after Ive shopped around to get the best that is in the local market.\r\n\r\nDont forget to encrypt your messages with pgp when sending personal information (Shipping Address).\r\nYour privacy is just important to me as my own.\r\n\r\nInclude a name (any name)\r\nWe dont keep your address only tracking number and last name.", "policy": "Refund Policy\r\n- Treat us with respect and you will also be respected\r\n- If a package is lost nine times out of ten we will reship your order (do not be an asshole)\r\n- If a packages tracking shows its delivered and you claim you did not receive it, normally no reship will be granted. But feel free to message us and we will see what we can do for you.\r\n- Reships are 100% at our discretion\r\n- In the case that your item is lost then we will reship the item as long as there are no BS disputes filed and the package is actually not delivered. All reships are sent after ensuring the package is still not en route or possibly still deliverable.\r\n**Before leaving any negative feedback, please contact us so we can investigate any issues you may have. We are always working our hardest to provide the best service for you!**\r\nIf your package does not arrive after 7 business days we will investigate the issue with the team above and get back to you with a possibility of a 50% Re-ship. Our job is to post the order and your job is to receive it, if it gets seized or lost then we both wear 50% of the cost. Fair.\r\nBuyer will NOT be refunded due to any damage caused by Australia Post.\r\nBuyer will NOT be refunded due to incorrect or false postage address. We copy and paste the address you provide us so please make sure it is correct and in the proper format like below.\r\n★★ IMPORTANT ONCE WE HAVE SEE ON OUR END THAT IS HAS BEEN DELIVERED THERE IS NO RESHIPS.\r\n\r\nHarrison Smith\r\n17 Some Street\r\nCarlton VIC 3053\r\n\r\nBuyer must accept all terms and conditions.\r\nThis item has a refund ratio of 50%. It means that in case of refund you might get only 50% funds back.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["AU"], "ships_to": ["AU"], "avatar": "/uploads/avatar_TStd2qJ.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/BELGIUMFINEST", "tagline": "look here for the best pharmaceutical ketamine powder/sugar and needles with no cuts", "details": "+++ 97% Pure Original Indian Pharmacy Shards/Needles or powder/sugar (KETAMINE)\r\n\r\n\r\n1g   -  30   Euro (30 Eur/gr)\r\n5g   -  100  EURO (20 Eur/gr)\r\n10g  -  180  EURO (18 Eur/gr)\r\n25g  -  400  EURO (16 Eur/gr)\r\n50g  -  700  EURO (14 Eur/gr)\r\n100g -  1200 EURO (12 Eur/gr)\r\n250g -  2500 EURO (10 Eur/gr)\r\n500  -  4000 EURO (8  Eur/gr)\r\n750  -  5250 EURO (7  Eur/gr)\r\n1000 -  6000 EURO (6  Eur/gr)\r\n \r\n\r\nNO SHIPPING COSTS\r\n\r\nWe buy almost everything in bulk so we can offer very good prices and maintain best quality. We sell both small and bulk.\r\n\r\n\r\n-------------------------------------------------------------------------------------------\r\n\r\nHow to find us?\r\nJust search for our vendor name: \"BESTKETAMINE\" in this market:\r\n\r\n\r\n-----------------------------------------------------------------------------------------------\r\n\r\n► We ship to whole EUROPEAN ONION from Belgium\r\n► Stealth is always being made with our full effort, and always are being made with care, we guarantee that our stealth is perfect!\r\n► Most orders are shipped the next day, Always with Priority Post!\r\n\r\n\r\n\r\n★★★  ★★★", "policy": "*** PRODUCT INFO ***\r\n\r\nThis Indian Ketamine powder/sugar and needles 97% is produced in a proffesional environment and mostly used for pharmaceutical purposes. \r\nImported from India. No cuts, this is potent, royal Ketamine! \r\n \r\n\r\n*** MAIN INFO ***\r\n\r\n- Shipped safely from Belgium \r\n- Free untracked worldwide shipping\r\n- Fits every mailbox worldwide\r\n- Bulk specialist\r\n- Good stealths and decoys\r\n- We treat all our buyers royally\r\n- Only royal quality uncut drugs\r\n- We ship every working day\r\n\r\n*** ESTIMATED TIME ARRIVAL ***\r\n\r\n- Europe: 3-15 working days\r\n\r\n\r\n*** SHIPPING ADDRESS FORMAT ***\r\n\r\nPlease send us your shipping address like this:\r\n\r\n- ADDRESSEE\r\n- STREET NAME + NUMBER\r\n- POSTAL CODE + CITY\r\n- COUNTRY\r\n\r\n*** REFUND & RESHIP POLICY ***\r\n\r\n- No refunds\r\n- Max 50% reship for known customers in case of seizure or lost\r\n- Please always contact us if there are any problems we will always try to help you out\r\n- Please first contact us before creating disputes or leaving negative feedbacks\r\n--------------------------------------------------------------------------------------------------------------------", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["BE"], "ships_to": ["AT", "AU", "BE", "BG", "CA", "CH", "CY", "DE", "DK", "EE", "ES", "FI", "FR", "GB", "GR", "HR", "HU", "IE", "LT", "LU", "LV", "MT", "NL", "NO", "PL", "PT", "RO", "SE", "SI", "SK", "UA", "US"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Benzoworld", "tagline": "My Self BenzoWorld", "details": "Hello Every One,\r\nThis is Benzoworld also you know mw as benzoqueen. i am glad to introduce my self as succesfull and truseted vendor from in other market like Empire DM YB have score more than 95% on all market.\r\n\r\nThanks For Visiting My Profile, We glad to introduce our self as Benzoworld,\r\nWe are dealing with Almost all Benzos, and pain killers, With High Grade Quality Product Direct From PHarmacy And Manufacturer.\r\nAll Our Existing Client Are 100% Satiesfied with our product and Sevices.\r\n\r\nWe Doing Domestic Shipping US to US and International UK, Europe To USA for ALl Order as per our most valuable clients, If Any Bulk Requirment please inbox me here.\r\n\r\nwe have 100% feedback on Empire, Darknet, WHM, Versus, Torrez, union, royal , darkode, vice, nemis, royal etc\r\n\r\nBuy with confidence from US and we accepting positive feed back after every order bought by all of our most valuable cients.\r\n\r\nThanks", "policy": "Processing Time 2-3 business day,\r\nWe Ship Via usps mail.\r\nWe do Reship if pacakage lost or misplaced by usps.", "is_trusted": false, "is_verified": true, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Biosphereshop", "tagline": "Original Subutex 8 mg., THC Vape Juice", "details": "Original SUBUTEX 8 mg , not generic from France.\r\nLetter size, will be delivered to your letterbox.\r\nA tracking number can be provided if your order is not delivered within 14 days, do not ask before.\r\nNo signature required.\r\nWe deliver to EU, USA and Canada.\r\n\r\n****************************************\r\n\r\n THC Vape Juice, 500 THC mg./ml.\r\nBottle 10 ml. ( 5000 THC mg. )\r\nPineapple smell.\r\nProduced from high quality Marrocan THC distillate and American Wax Liquidiser. ( https://www.waxliquidizer.com/ )\r\nDoes not contain vitamin E acetate & glycerin, PG only.\r\nNo marijuana smell, you can vape in public places.\r\nMade in France with love.\r\n\r\n***************************************\r\n\r\nPlease send delivery address in the following format :\r\n\r\nName, First Name,\r\nHouse number\r\nStreet\r\nCity\r\nPostcode\r\nCountry\r\n\r\nPlease encrypt your shipping address with my GPG !\r\nOr use disposable note service with password, if you don't know how to use GPG. ( https://temp.pm/ )\r\nThis is a safety issue for you and me.\r\nThank you for your understanding.", "policy": "Refund Policy\r\n\r\n\r\n100% reship or 50% refund if letter is lost or seized by customs\r\nWe reship only once!\r\nBy placing an order you agree to these rules.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["FR"], "ships_to": ["AD", "AT", "BA", "BE", "BG", "CA", "CH", "CY", "CZ", "DE", "DK", "EE", "ES", "FI", "FR", "GB", "GR", "HR", "HU", "IE", "IL", "IS", "IT", "LI", "LT", "LU", "LV", "MC", "ME", "MT", "MX", "NL", "NO", "PL", "PT", "RO", "RS", "SE", "SI", "SK", "TR", "UA", "US", "UY"], "avatar": "/uploads/avatar_PR2TioK.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/brightstarfountain", "tagline": "premium quality natural entheogens * cannabis * dmt * good vibes only", "details": "welcome to Brightstar Fountain store ..\r\n\r\nwe have been providing quality products on darknet for over 7 years now. our reputation is well known and there are various sites that have archived many reviews. darknet trust and perhaps recon if they are still online. just check for the pgp public key on the profile to look up the history.\r\n\r\nall of our reviews are authentic. we never pad or fake like seems to be a common practice on the darknet.\r\n\r\nto those who would care to share their experience with brightstar fountain on a review, thanks you.\r\n\r\nit is not easy to run a darknet business and to anyone who would suggest otherwise, they are not doing it properly. it requires a lot of effort to safely package and ship the products and the same effort is given to each and every package.\r\n\r\nyou can expect nothing short of perfection when you are working with us.\r\n\r\nall orders are shipped with tracking available, guaranteed to arrive and to be proper. if for any reason in the rare circumstance of a couriers mistake the pack does not arrive in a timely manner, it will be reshipped.\r\n\r\nif in the very rare circumstance you receive the wrong order or weight, the proper order will be reshipped and the first order received can be a gift.\r\n\r\nour care and effort is unprecedented and you will not go wrong when shopping with us. our products may appear to cost a bit more sometimes because we are not competing with low ballers and fake offers. we are offering always top quality and always perfect shipping service. you really do get what you pay for when you work with us.\r\n\r\nif you have any questions just send a message, i am always happy to hear from customers. we also offer support, guidance, and suggestions for the use of our products.\r\n\r\nkind regards and best wishes\r\n-b", "policy": "all sales final.\r\nall items guarantee to be accurate description;\r\nall items guarantee to arrive safely.", "is_trusted": false, "is_verified": true, "num_reviews": 67, "num_stars": 4.94, "disputes": null, "ships_from": ["US"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_2CuDWqX.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/CalicniShop", "tagline": "A few clicks is all it takes. Discover the difference!", "details": "L'équipe Calicni est honoré de vous présenter son autoshop de documents digitals et physique. \r\nCarte d'identité physique, dont la qualité saura ravir les fins gourmets d'escroquerie en tout genre et autres raclures notoires! \r\n\r\nDisponible dès maintenant:\r\n\r\n- CNI DROP \r\n- CNI GOLD \r\n- CNI FULL \r\n\r\n\r\nFORMULAIRE \r\nInformations de la CNI \r\n\r\n• Nom:\r\n• Prénom:\r\n• Sexe:\r\n• Date de Naissance:\r\n• Ville de Naissance:\r\n• Taille en cm:\r\n\r\n• Adresse:\r\n• Code Postal:\r\n• Ville:\r\n\r\n• Date de délivrance: (Facultatif)\r\n• Préfecture: (Facultatif)\r\n                          \r\nInformations de LIVRAISON \r\n\r\n• Nom:\r\n• Prénom:\r\n\r\n• Adresse:\r\n• Code Postal:\r\n• Ville:\r\n\r\n\r\n• Photo (Photomaton uniquement, une mauvaise photo peut faire échouer certaines vérifications)\r\nVOUS POUVE UPLODER SUR dump.li\r\n\r\nhttp://dumpliwoard5qsrrsroni7bdiishealhky4snigbzfmzcquwo3kml4id.onion/ \r\n\r\n• Signature (Photo de la signature sur papier si vous souhaitez en avoir une en particulier)\r\n\r\nPOUR DOUBLETTE ENVOYER LE RECTO ET LE VERSO A COPIER.", "policy": "LIVRAISONS: \r\n\r\nToutes les expéditions s’effectuent en collaboration avec les services de LaPoste. \r\n\r\nNos courriers sont envoyés par le mode d’affranchissement « Lettre Service Plus », garantissant une livraison en J+2 à compter de la date de dépôt du courrier. \r\n\r\nPAIEMENTS:\r\n\r\nLes paiements s’effectuent uniquement en crypto-monnaie XMR. \r\n\r\nCAS PRATIQUES:\r\n\r\nEn cas d’erreur dans la fabrication, 2 cas de figure s’appliquent: \r\n\r\n✉️ Une erreur est commise, dont la faute nous incombe (algo mal calculé/info mal recopiée/erreur de fabrication flagrante).\r\n➡️ Nous nous engageons à refaire votre commande, sans aucun frais supplémentaire.\r\n\r\n✉️ Une erreur est commise, dont la faute vous incombe. \r\n➡️ Vous serez dans l’obligation de vous acquitter de la somme correspondant à votre  \r\ncommande si vous souhaitez une re-fabrication de celle ci. Un geste commercial pourra être effectué à notre bon vouloir.\r\n\r\n\r\n\r\nEn cas de perte du courrier qui vous est destiné, 2 cas de figure \r\ns’appliquent: \r\n\r\n✉️ Le courrier n’a pas pu être distribué car le facteur n’a pas su identifier la boîte au lettre du destinataire.\r\n➡️ La faute vous incombe, vous avez raté votre drop, aucune réduction ne vous sera octroyée et aucun arrangement ne sera possible, sauf cas exceptionnel. \r\n\r\n\r\n✉️ Le courrier se perd réellement et le suivi reste bloqué: \r\n➡️ Si après 15 jours le statut du suivi ne change pas à compter de la date d’activation du suivi, la commande vous est gracieusement refaite en échange de 50% du prix de celle-ci, aucun changement d’information ne sera toléré mis à part un éventuel changement d’adresse.\r\n\r\n\r\n_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_\r\n\r\n\r\nLes conditions susdites s’appliquent à tout document physique proposé sur ce canal, elles sont définies par le propriétaire et susceptible d’être modifiées à tout moment, chaque client se doit d’en prendre connaissance avant de passer commande afin de faire valoir ses droits.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["FR"], "ships_to": ["FR"], "avatar": "/uploads/avatar_H7omqLS.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Carlosmano_Store", "tagline": "Home for digital products and services", "details": "Welcome everyone to the most unique place for all your digital needs and vices, we also offer on demand services and products. Just let us know what you want and we shall fetch it for you. We sell account logins, fraud related guides and methods, crypto accounts, freshly hacked databases, among other digital items", "policy": "We appreciate you buying from us and we promise we won't disappoint but in case of any rare misfortune event that you have problem with any of our products, kindly let us know and we shall work something out.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_w7ukDOi.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/castle.of.pills", "tagline": "Your everyday vendor. Always at your service", "details": "This vendor account is created for demonstration purpose only.", "policy": "We ship everywhere! When you place an order for us, please provide your shipping details in the following form:\r\n\r\n*Recipient's name\r\nStreet no and name\r\nApartment number (if applies)\r\nCity or town\r\nZip or postal code*\r\n\r\nPlease use a **real** recipient's name. Fake names raise suspicion and thus such packages are more likely to fail delivery. We do *not* reship if you do not receive your package due to fake recipient's name.", "is_trusted": false, "is_verified": true, "num_reviews": 3, "num_stars": 4.67, "disputes": null, "ships_from": ["NO", "SE"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Chang1993", "tagline": "welcome to wholesale supply", "details": "", "policy": "Refund Policy;\r\n\r\nAddress Failures will not get refunded! \r\nAfter Sending proof of shipment buyer releases the Money.\r\nReship/Refund 50% only!\r\nAfter proof of Reship/refund buyer releases The Money!\r\n\r\nNo reships to Pack station!", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": [], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_ljDAmdc.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/chemsofmagic", "tagline": "Specialists in tryptamines", "details": "", "policy": "", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["IE"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Cheshirecat82", "tagline": "Wonderland Shop", "details": "Hello there, Cheshire here!\r\n\r\n*EU SHIPPING FOR LSD ONLY*\r\n\r\nTrip into wonderland, let us fall down that rabbit hole together..\r\nFacilitating the sacred, ancient Reconnection to Mother Earth!\r\n\r\nWe have new mushrooms and new crystals, and they are the best quality we have seen. New strains of mushrooms that we are working with are penis envy as well as penis envy crossed with amazonians. We also now have beautiful N,N-DMT. All of our products are vacuum sealed, then sealed in very thick 4.5mil mylar, with decoy. We make sure all of our vacuum seals are tight. Our priority is absolute stealth and security. We can assure that all of our products come from our own hands, our product. We make it a point to carry ourselves at the gold standard. Our sources are 100% and so is our quality. We do this because we love this and we will only provide the best quality psychedelics and allow for the best experience that we possibly can in sharing these molecules. We ship every single day that the mail runs, Monday through Saturday, and answer messages M-F. Occasionally we may miss a day depending on holidays and the post office. We do our part in providing the highest quality in safe products, please do your part to research and be safe with any psychedelic you decide to put in your body. Harm reduction is key to having a safe and positive psychedelic experience. Keep it potent and keep it safe!\r\n\r\nWe are always striving to be awesome, so if you think we are awesome, please tell us about it in a review!!\r\n\r\nI specialize in safe psychedelics. I believe in my molecules and what they can do to help people, and I want them to be available to those that seek them. Our mushrooms are old family recipes, fungi that have been handed down from generation to generation. Lab grown from dedicated farmers with over 40 years experience, grown with so much love and care, and dried cracker crisp. These are full, stout mushrooms with a cap for every stem!\r\n\r\nOur N,N-DMT is made from high quality MHRB, Mimosa hostilis root bark, from South America. We recrystallize it several times with hexane. It is white and crystalline, and pharmaceutical grade at 99.8% purity. We offer this molecule because we believe in this molecule, and we put the utmost care and love into it because we will only offer the best.\r\n\r\nWe have been vending solely psychedelics for over 10 years across the darkweb, you can check out our thousands of happy and positive reviews and ratings on Recon and Darknet Trust at cheshirecat82 I would appreciate it if you left me a review about the quality, service, and experience of my store and the medicine molecules I share. Your feedback goes a long way in creating ripples that help to build this web.\r\n\r\nhttp://recon222tttn4ob7ujdhbn3s4gjre7netvzybuvbq2bcqwltkiqinhad.onion/vendor/0xEDC65952D9946EA1\r\n\r\nLeave a review on my subdread!\r\n/d/cheshirecat82\r\n\r\nALWAYS REMEMBER, I LOVE YOU! ITS ABOUT THE EXPERIENCE!\r\n\r\n\r\nAlways remember I love you\r\n-Cheshire", "policy": "**PLEASE READ MY FULL TERMS AND CONDITIONS BEFORE ORDERING!!**\r\n\r\n-- If you cannot finalize your order within a couple days of receiving your package, then please do not order from me. When large volumes of orders go to auto-finalization, it affects me enough to the point that I would have to shut down. I do my part to get these safe psychedelics to you, please do your part so that I can continue to provide these for you.\r\n\r\n-- Orders usually take 3-5 days to land from the time they are shipped. However, it can take longer during times of the year when the mail system gets overwhelmed and delayed.\r\n\r\n-- PLEASE USE PGP FOR ALL SENSITIVE INFORMATION!\r\n\r\n-- ADDRESS INFO:\r\n\r\n-- MAKE SURE YOU SEND ME YOUR CORRECT ADDRESS!! TRIPLE CHECK FOR ACCURACY AND COMPLETION!! IF YOUR PACKAGE DOES NOT LAND BECAUSE OF AN INCORRECT ADDRESS, NOT ONLY DO YOU NOT GET YOUR ORDER, BUT YOU PUT ME AT RISK!!\r\n\r\n-- PLEASE PROPERLY FORMAT YOUR ADDRESS. VENDORS SHOULD NOT HAVE TO DO ANY EDITING WITH SHIPPING INFO!\r\n\r\n-- SEND SOME KIND OF A NAME WITH YOUR ADDRESS. REAL OR FAKE. I WILL NOT ACCEPT CURRENT RESIDENT AS A NAME. LIKE I SAID... MAKE ONE UP!!\r\n\r\n-- NO FUNNY NAMES! FOR EXAMPLE: HONG FAT, OR MYY WANG.\r\n\r\n-- TRACKING NUMBER: ALL ORDERS GET A TRACKING NUMBER\r\n\r\n-- WE DO PROVIDE TRACKING NUMBERS IF YOU ASK. WE SHIP EVERY DAY SO IT SHOULD BE PRETTY EASY TO TELL WHEN YOUR PACKAGE WILL LAND. IT DOES TAKE TIME TO LOOK UP AND SEND YOUR TRACKING NUMBER, WE ARE VERY BUSY, PLEASE KEEP THIS IN MIND\r\n\r\n-- HOURS OF OPERATION:\r\n\r\n-- I CHECK MESSAGES M-F\r\n\r\n-- I SHIP ORDERS OUT MONDAY THROUGH SATURDAY\r\n\r\n-- WE WORK VERY HARD FOR YOU GUYS TO PROVIDE THESE SACRED MOLECULES IN A FAST AND SAFE MANNER\r\n\r\n-- REFUNDS:\r\n\r\n-- I ISSUE FULL REFUNDS OR RESHIPS FOR PACKAGES THAT DO NOT LAND, UNLESS THE REASON IT DID NOT LAND IS BECAUSE YOU GAVE ME THE WRONG ADDRESS. SCAMMERS, I HAVE BEEN DEALING WITH YOU FOR SO LONG, DO NOT TRY! ALL MY STUFF HAS TRACKING NUMBERS! IF THE TRACKING NUMBER SAYS IT WAS DELIVERED, I WILL NOT REFUND!\r\n\r\nFEEL FREE TO CONTACT ME WITH ANY QUESTIONS!", "is_trusted": false, "is_verified": true, "num_reviews": 20, "num_stars": 5, "disputes": null, "ships_from": ["US"], "ships_to": ["AT", "BE", "BG", "CA", "CY", "CZ", "DE", "DK", "EE", "ES", "FI", "FR", "GR", "HR", "HU", "IE", "IT", "LT", "LU", "LV", "MT", "NL", "PL", "PT", "RO", "SE", "SI", "SK", "US"], "avatar": "/uploads/avatar_34srg3L.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/clockwerk", "tagline": "purveyor of The finest Cocaine,LSD,MDMA since 2018", "details": "!!! IF YOUR ORDER HAS BEEN MARKED SHIPPED IT SHIPPED.\r\nONLY TRACKING REQUEST AND WRONG/ISSUED PRODUCT MESSAGES WILL BE RESPONDED TO.INCLUDE ORDER NUMBER IN SUBJECT,INCLUDE:ITEM,DATE SHIPPED,AMOUNT ORDERED,ZIPCODE AND UN ENCRYPTED PUB KEY IN MESSAGE,OR WE WILL DELETE MESSAGE.OR ISSUE/S WITH RECEIVED ORDER.\r\nWE HAVE NO TIME TO RESPOND TO MESSAGES OF OTHER SUBJECT,ALL CAN BE FOUND BELOW AND ON PRODCT PAGE*\r\n\r\n\r\n\r\n======================\r\nWe keep it safe simple and easy.Always a Honest discriptionfree shipping/Mylar/vac.seal/printed label etc. All packs Require no Signature and are shipped From the USA. We ship within 48 HRS from when We recieve Your Order.But 99% of the time it Is shipped within hours.\r\n\r\nOur goal is to provide A better,Cleaner safer PRoduct than You will Find on the Street\r\nin a 10 day or less Turn around.\r\n\r\n!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!PLEASE READ BEFORE MESSAGE/ORDER!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\nIF ITEM IS 8 DAYS OR MORE LATE SEND 1 MESSAGE INCLUDING\r\n.ITEM\r\n.AMOUNT\r\n.DATE SHIPPED\r\n.ZIPCODE\r\n.YOUR PUBLIC KEY (UN ENCRYPTED)\r\n\r\n==================REFUND/RESHIP\r\nWE ONLY RESHIP/FUND IF TRACKING SHOWS WE OR USPS MADE A MISTAKE.PLEASE COPY YOUR ADDRESS WITH FULL NAME AND IN PROPER USA FORMAT.WE WILL NOT REFUND/SHIP PACKAGES MARKED DELIVERED AND OR UN DELIVERABLE ADDRESS/ADDRESS FORWARD EXPIRED.\r\n*WE DO NOT RESHIP/FUND IF YOU FAIL TO USE/PROVIDE NAME WITH YOUR ADDRESS\r\n\r\nTHIS IS HOW TO WRITE YOUR ADDRESS IN THE USA\r\n\r\nMarta Soto\r\n1223 S Front ST APT#123\r\nChino,CA 94922-8783\r\n\r\n\r\n\r\n========PGP\r\n!!!! DO NOT SIGN PGP MESSAGE!!", "policy": "==================REFUND/RESHIP\r\nWE ONLY RESHIP/FUND IF TRACKING SHOWS WE OR USPS MADE A MISTAKE.PLEASE COPY YOUR ADDRESS WITH FULL NAME AND IN PROPER USA FORMAT.WE WILL NOT REFUND/SHIP PACKAGES MARKED DELIVERED AND OR UN DELIVERABLE ADDRESS/ADDRESS FORWARD EXPIRED.\r\n*WE DO NOT RESHIP/FUND IF YOU FAIL TO USE/PROVIDE NAME WITH YOUR ADDRESS", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_pEZlzdt.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Cloud7CannaCrew", "tagline": "100% eigene Kultivierung (keine Zukäufe)", "details": "Cloud7CannaCrew\r\nHAUSEIGENE CANNABIS-ERZEUGNISSE\r\n\r\n100% eigene Kultivierung (keine Zukäufe)\r\n100% sauberes Cannabis\r\n100% Diskretion\r\n\r\nUnser Augenmerk liegt auf der Verfügbarmachung von hochwertigem CBD & THC Canna. Alle Erzeugnisse/Angebote stammen aus eigener Kultivierung (keine Zukäufe) und sind frei von Industrieabfällen wie Pestiziden und/oder Fungiziden.\r\nDas Erfüllen hoher Qualitätsstandarts in Verbindung mit dem Anspruch äußerster Kundenzufriedenheit bedarf keiner weiteren Erwähnung.", "policy": "UNSERE AGB\r\n\r\nVERSAND\r\n\r\nNUR in Deutschland und nach Österreich!!!\r\n\r\nEure Bestellungen werden Dienstags & Donnerstags eingeworfen!\r\nBestellungen bei denen Drop & XMR bis Mitternacht des Versand-vor-Tages bei uns sind, werden am jeweiligen Versandtag (Dienstags & Donnerstags) mit berücksichtigt, alles was später als Mitternacht kommt, geht erst am nächsten Versandtag auf die Reise!\r\n\r\nVERPACKUNG\r\n\r\nDiskret und, dem Inhalt entsprechend, unverdächtig.\r\n\r\nVERSANDKOSTEN\r\n\r\nEs werden pauschal 4€ berechnet!\r\n\r\nVERSANDTAGE\r\n\r\nDienstag & Donnerstag\r\n\r\nBEZAHLUNG\r\n\r\nBTC / Bitcoin & XMR / Monero\r\n\r\nERSTATTUNG\r\n\r\nVersand an Packstationen auf eigene Gefahr: KEIN RESHIP/REFUND!\r\n\r\n100% Reship auf Sendungen mit Tracking (ab 250€ Bestellwert dazu buchbar; schreib uns dafür an!), wenn der Fehler bei uns lag.\r\nAuf Sendungen ohne Tracking gibt es keinerlei Refund oder Reship \r\n\r\nKONTAKT\r\n\r\nKontakt über Bitmessage: BM-NBB3wQAVvgKfRQqF2D1SxLzvzAFSDz5B\r\nC7CC-Newsletter: BM-NBM3Uu5pn19P1MPMVRm23Mqa25cduxFK (einfach diese Adresse im Bitmessage abonnieren)))))))))))))", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["DE"], "ships_to": ["AT", "DE"], "avatar": "/uploads/avatar_8HpPBiF.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/DMT_Goddess", "tagline": "To know me is to love me, to love me, is to know me", "details": "Hello and welcome to my DMT Goddess DMT Store\r\n\r\nI am the gatekeeper with keys to various astro-planes of conscious evolution of awareness.\r\n\r\nMy goal is to provide those who have reached this part in their conscious evolution that Source Consciousness has brought you to me...for further travel...\r\n\r\nto enter into the next chapter of  conscious evolution God Consciousness\r\n\r\nI only serve  naturally sourced n-n-dmt (N,N-Dimethyltryptamine) obtained from holistic farms deep in Brazil.\r\n\r\nPrepared using high industry grade standards to bring you great quality n-n dmt.\r\n\r\nDMT: also known as the Spirit molecule serves as the keystone which allows communication and interaction with benevolent non physical life forms and Source God himself.\r\n\r\nAllow me to be your shamanka and assist in your spiritual journey via dmt.\r\n\r\nMuch Love\r\nDMT Goddess", "policy": "I am here to assist and help those seeking to reach a higher stage of conscious evolution.\r\n\r\nIf you ever encounter any problems or concerns please message me and I will do my best to create harmony and resolution.\r\n\r\nNo orders are ever sent tracked.\r\n\r\nAll order are shipped using Standard Letter Mail post.\r\n\r\nRe-shipments and refunds are at the soul discretion of DMT Goddess.\r\n\r\nI wish you Love", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["CA"], "ships_to": ["CA", "DE", "FI", "FR", "GB", "GL", "GR", "IE", "IN", "IS", "IT", "JP", "PK", "UM", "US"], "avatar": "/uploads/avatar_DtWKiEf.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Dreamseven", "tagline": "Welcome to the Dream 7 store", "details": "Welcome to the Dream 7 store.\r\nPlease check our profile before ordering for more information\r\nNote: This store is the only hosted store from the United States to the United States.\r\nNote: Please use pgp to encryption your address. Unencrypted addresses will be cancelled orders\r\n\r\n\r\n\r\n\r\nPRODUCT \r\n- Ketamine S-isomer Powder/Sugar / Needle / Rock\r\n\r\n\r\nAll products are imported from Europe.High Quality S-isomer Ketamine!\r\nwe don’t sell anything that we wouldn’t take.\r\nOur shop was grown out of our love of what we sell, we are users first and foremost long before we sold. We have been the consumer AND the seller!\r\nWe believe this puts us in a far better position to know what you guys expect from an online vendor.\r\nWe Do Not Do Negative Feedback, So Please Any Issues Always Get In Touch We Will Always Resolve It And To Best Of Our Ability And Turn It Positive .\r\nRemember: Any information, please encrypt!!!!", "policy": "Transportation time:\r\nPriority 3-5 days\r\nExpress 1-2 days  *Not recommended* (All EXPRESS will be scanned by the machine. But ordinary ones will not)\r\nShipping:  Monday to Saturday.\r\nThe daily order deadline is 12:00 noon.\r\nIf you need a tracking number, please send me a message", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_NgoiiHK.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Dream_Weaver", "tagline": "", "details": "", "policy": "*****NEW 2022 TERMS AND CONDITION *****\r\n\r\nINDEX\r\n\r\n1. Reships/Refunds\r\n2. FE\r\n3. Tracking\r\n4. Shipping time\r\n5. Address Format\r\n\r\n_________________________________________________________________________________________________________________________________________________________\r\n\r\n1. ***Reships/Refunds***\r\n\r\nThe general rule is that every customer is being taken care of individually.\r\nWe always take in to consideration the amount of order made with us/general and how long you've been active on DNMs.\r\nFirst time buyers with us or fresh accounts are not entitled to any reship/refunds.\r\n_________________________________________________________________________________________________________________________________________________________\r\n\r\n2. ***FE***\r\n\r\nFE means Finalize Early - We only sell via this option. Don't ask for anything else. We only vend on markets and don't do private deals. \r\nFinalize Early means you are relasing the funds to us so we can then proceed with sending your package.\r\n_________________________________________________________________________________________________________________________________________________________\r\n\r\n3. ***Tracking***\r\n\r\nWe do not provide tracking codes as simply we don not offer such service in first place.\r\nWe are only sending our packages via stamps for yours and our safety. Remember, packages sent by stamps don't leave any kind of a trace on any system anywhere! Your safety and ours is our top priority and we recommend to never order packages from other vendors who use tracking services.\r\n_________________________________________________________________________________________________________________________________________________________\r\n\r\n4. ***Shipping time***\r\n\r\nWe always aim to send out our packages on the same day as the order was placed, if it was placed before 11am. \r\nShipping times can vary but please, be prepared for those waiting times:\r\nUK - UK: 1 to 14 days\r\nUK - Europe: 3 - 21 days\r\nUK - Outside of EU: 10 - 60 days\r\n\r\nPlease, do not contact us about your missing package until the above days has passed since you've put your order.\r\n_________________________________________________________________________________________________________________________________________________________\r\n\r\n5. ***Address Format***\r\n\r\nIt is your responsibility to be sure that you've provided the right address format for your country. Please, KEEP IT SIMPLE!\r\nDon't add any extra lengthy stuff if it's unnecessary \r\nMost of the times your address should be kept down to a format like this\r\n\r\nJohn Doe\r\n123 Weed Street\r\nWeedville\r\nW3 3DA\r\nUNITED WEEDDOM\r\n\r\n6. ***Anything else***\r\n\r\nFor anything more, please contact us directly.", "is_trusted": false, "is_verified": true, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["GB"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/drugshelvita", "tagline": "Welcome to Dr Helvita", "details": "======> WELCOME TO DRUGS HELVITA \r\n\r\n\r\n=====> In stock : \r\n- Ecstasy pills 200mg\r\n-Amphetamine paste\r\n -Amphetamine dry\r\n\r\n=====> Back in stock soon : \r\n- Methamphetamine \r\n\r\n\r\n=====> On future in store  :\r\n-Cocaine\r\n-Heroine\r\n- Khetamine\r\n\r\n=======> Don't order to high we don't ship out of SWITZERLAND", "policy": "=======> ADDRESS FORMAT \r\n> FULL NAME\r\n> STREET AND HOUSE NUMBER\r\n> CITY , POSTAL CODE \r\n\r\n\r\n======> REFUND POLICY  or other questions send us a message!\r\n> Please contact me if you feel you have not been provided a 5/5 experience. I will make it right or improve it, but must be reasonable\r\n> Provide me a REAL Name & Address! If not, its at your own risk!\r\n> Don't use a address, you ever had problems with receiving items!", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["CH"], "ships_to": ["CH"], "avatar": "/uploads/avatar_BS3VkNN.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Drugula", "tagline": "", "details": "", "policy": "", "is_trusted": false, "is_verified": true, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": [], "ships_to": ["AQ"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/duckdopego_vendor_shop", "tagline": "Where the dopest people go.", "details": "# DuckDopeGo \r\nstarted as a passion project to deliver the sort of experience that I wanted as a buyer. I am always busier than I think I'm gonna be and try to treat people as I would want to be treated. A few guidelines \r\n-    I do not always always respond to non-essential messages. I do not serve anyone showing signs of intoxication or anyone that I get a bad feeling about. \r\n-    I choose my words deliberately and I mean what I say. \r\n-    I bend over backwards for regulars and the people that have followed me from market to market *(love you folks)*.\r\n\r\n**The premise of my mission is simple and clear**\r\n- nobody has the right to exact control over what someone else chooses to put into their body. I am not a proponent of any substance. I am a proponent of free will.", "policy": "# By ordering from DuckDopeGO, all buyers agree to the following terms\r\n\r\n-    All orders are final. There are no refunds and no reships unless a mistake is made by **DDG.**\r\n\r\n-    **DDG** *reserves the right to refuse service to anyone.*\r\n\r\n-    ***No direct deals will be considered.***\r\n\r\n-    The products provided should not be perceived as **safe.** All buyers are urged to use caution.\r\n\r\n-    All orders are *tracked.* These tracking numbers are not shared with buyers due to the **negative** effect it may have on operational security.\r\n\r\n-    The stopwatch for delivery starts *once the item is sent and assumes ordinary conditions.*\r\n\r\n-    **DDG** does not keep long-term records. Data pertinent to an unresolved transaction is permanently destroyed once the transaction is completed.\r\n\r\n-    If there is any issue, please send an *encrypted* message and allow 24 hours for a response. Negative comments, ratings and especially disputes made by buyers who have not given **DDG** an adequate amount of time to respond only lessen their chances of a positive outcome. **DDG** *will not willingly refund or reship a disputed transaction* but **WILL** work with everyone to ensure a five star experience if given the opportunity.\r\n\r\n-    **Stealth:** The vast majority of packages facing ordinary scrutiny go undetected. **DDG** has an **OUTSTANDING** success rate in regards to packages making it to their destination.  However, please send an *encrypted message if you have special stealth requirements.*  As a best practice all buyer messages should be encrypted.\r\n\r\n-    Choosing the *Sample Shipping* Option for non sample orders is strictly prohibited and will result in a cancelled order. \r\n\r\n- **Buyers are responsible for clarifying anything that is unclear to them within these terms. No policy exceptions will be made due to ignorance.**", "is_trusted": false, "is_verified": true, "num_reviews": 5, "num_stars": 5, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_r8IEtTP.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/DUTCHFINEST", "tagline": "look here for the best pharmaceutical ketamine powder/sugar and needles with no cuts", "details": "+++ 97% Pure Original Indian Pharmacy Shards/Needles or powder/sugar (KETAMINE)\r\n\r\n\r\n1g   -  30   Euro (30 Eur/gr)\r\n5g   -  100  EURO (20 Eur/gr)\r\n10g  -  180  EURO (18 Eur/gr)\r\n25g  -  400  EURO (16 Eur/gr)\r\n50g  -  700  EURO (14 Eur/gr)\r\n100g -  1200 EURO (12 Eur/gr)\r\n250g -  2500 EURO (10 Eur/gr)\r\n500  -  4000 EURO (8  Eur/gr)\r\n750  -  5250 EURO (7  Eur/gr)\r\n1000 -  6000 EURO (6  Eur/gr)\r\n \r\n\r\nNO SHIPPING COSTS\r\n\r\nWe buy almost everything in bulk so we can offer very good prices and maintain best quality. We sell both small and bulk.\r\n\r\n\r\n-------------------------------------------------------------------------------------------\r\n\r\nHow to find us?\r\nJust search for our vendor name: \"DUTCHFINEST\" in this market:\r\n\r\n\r\n-----------------------------------------------------------------------------------------------\r\n\r\n► We ship to whole EUROPEAN ONION from the Netherlands\r\n► Stealth is always being made with our full effort, and always are being made with care, we guarantee that our stealth is perfect!\r\n► Most orders are shipped the next day, Always with Priority Post!\r\n\r\n\r\n\r\n★★★  ★★★", "policy": "*** PRODUCT INFO ***\r\n\r\nThis Indian Ketamine powder/sugar and needles 97% is produced in a proffesional environment and mostly used for pharmaceutical purposes. \r\nImported from India. No cuts, this is potent, royal Ketamine! \r\n \r\n\r\n*** MAIN INFO ***\r\n\r\n- Shipped safely from the Netherlands,\r\n  ketamine is NOT on the druglist of the Netherlands \r\n- Free untracked worldwide shipping\r\n- Fits every mailbox worldwide\r\n- Bulk specialist\r\n- Good stealths and decoys\r\n- We treat all our buyers royally\r\n- Only royal quality uncut drugs\r\n- We ship every working day\r\n\r\n*** ESTIMATED TIME ARRIVAL ***\r\n\r\n- Europe: 3-15 working days\r\n\r\n\r\n*** SHIPPING ADDRESS FORMAT ***\r\n\r\nPlease send us your shipping address like this:\r\n\r\n- ADDRESSEE\r\n- STREET NAME + NUMBER\r\n- POSTAL CODE + CITY\r\n- COUNTRY\r\n\r\n*** REFUND & RESHIP POLICY ***\r\n\r\n- No refunds\r\n- Max 50% reship for known customers in case of seizure or lost\r\n- Please always contact us if there are any problems we will always try to help you out\r\n- Please first contact us before creating disputes or leaving negative feedbacks\r\n--------------------------------------------------------------------------------------------------------------------", "is_trusted": false, "is_verified": false, "num_reviews": 2, "num_stars": 5, "disputes": null, "ships_from": ["NL"], "ships_to": ["AL", "AM", "AR", "AT", "BE", "CH", "CY", "CZ", "DE", "DK", "DZ", "EC", "EE", "ES", "FI", "FR", "GB", "GE", "GR", "HR", "HU", "IE", "LU", "LV", "NL", "NO", "RO", "SE", "SI", "SK", "UY"], "avatar": "/uploads/avatar_HC6UjEL.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/easydrugseurope", "tagline": "easyDrugs europe. Trusted vendor. Pure Colombian Cocaine and Premium Moroccan Hash.", "details": "⭐⭐easyDrugs europe⭐⭐ Trusted vendor.\r\nPure Colombian Cocaine and Premium Moroccan Hash.\r\nWe are based in the south of Spain, one of the main routes of distribution of Colombian Cocaine and Moroccan Hash. We work with the best Colombian and Moroccan producers.\r\n***Shipping worldwide***\r\n\r\nTracked shipping ☑️\r\n24h shipped ☑️\r\nProfessional Stealth ☑️\r\nCustomer service ☑️\r\n100% reship if not delivered ☑️\r\nGuaranteed Quality ☑️\r\n100% positive reviews ☑️\r\nMore than 100 successful orders ☑️\r\nShipping from Spain ☑️\r\n\r\nHighest quality products .\r\n\r\nLet's trade and make a connection!\r\n\r\n🚀Destination countries: Andorra, Aruba, Australia, Austria, Barbados, Belgium, Brazil, Canada, China, Croatia, Cyprus, Czech Republic, Denmark, Dominican Republic, Egypt, Estonia, Finland, France, Georgia, Germany, Gibraltar, Greece, Hong Kong, Hungary, Iceland, Indonesia, Ireland, Israel, Italy, Japan, Jersey Island, Latvia, Lebanon, Lithuania, Luxembourg, Malaysia, Malta, Mexico, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Russia, Saudi Arabia, Serbia, Singapore, Slovakia, Slovenia, South Africa, South Korea, Spain, Swaziland, Sweden, Switzerland, Thailand, Turkey, Ukraine, United Kingdom.\r\n\r\nDelivery times: \r\n- Spain: 1-3 business days.\r\n- Europe: 6-10 days\r\n- Russia: 2-3 weeks.\r\n- America: about 3 weeks.\r\n- Australia / NZ: 2-3 weeks.\r\n- Asia:about 3 weeks.\r\n- Africa: 2-3 weeks.\r\n\r\nRefund Policy:\r\nEU countries 25% reship, 100% after one success delivery.\r\nEuropean Countries 25% reship, 100%  after one success delivery.\r\nRest of countries 25% reship, 100% after two success deliveries.\r\n\r\nRULES FOR CORRECT DELIVERY\r\n· First name, last name.\r\n· Address: street, number , stair, flat....\r\n· Postal ZIP\r\n· City\r\n· State.\r\n· Country", "policy": "🚀Destination countries: Andorra, Aruba, Australia, Austria, Barbados, Belgium, Brazil, Canada, China, Croatia, Cyprus, Czech Republic, Denmark, Dominican Republic, Egypt, Estonia, Finland, France, Georgia, Germany, Gibraltar, Greece, Hong Kong, Hungary, Iceland, Indonesia, Ireland, Israel, Italy, Japan, Jersey Island, Latvia, Lebanon, Lithuania, Luxembourg, Malaysia, Malta, Mexico, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Russia, Saudi Arabia, Serbia, Singapore, Slovakia, Slovenia, South Africa, South Korea, Spain, Swaziland, Sweden, Switzerland, Thailand, Turkey, Ukraine, United Kingdom.\r\n\r\nDelivery times: \r\n- Spain: 1-3 business days.\r\n- Europe: 6-10 days\r\n- Russia: 2-3 weeks.\r\n- America: about 3 weeks.\r\n- Australia / NZ: 2-3 weeks.\r\n- Asia:about 3 weeks.\r\n- Africa: 2-3 weeks.\r\n\r\nRefund Policy:\r\nEU countries 25% reship, 100% after one success delivery.\r\nEuropean Countries 25% reship, 100%  after one success delivery.\r\nRest of countries 25% reship, 100% after two success deliveries.\r\n\r\nRULES FOR CORRECT DELIVERY\r\n· First name, last name.\r\n· Address: street, number , stair, flat....\r\n· Postal ZIP\r\n· City\r\n· State.\r\n· Country", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["ES"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_IoUkgDe.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/ephed", "tagline": "relax, i'm a darktor. as in, a licensed thizzician. darktor ephed pheelgood, aka phed phlintstone. registered sexy vendor.", "details": "i sell meff til dare 8 nuns leff", "policy": "no refunds. message me with issues or concerns.\r\nno tracking info is my policy. sadly, not likely to show up on informed delivery either for some odd reason. expect it to arrive more or less on time.\r\n\r\ntriple check that you are giving me the right destination address without any typos or missing essentials.\r\n\r\nusa to usa only.\r\n\r\ni aim to please. you will not find better meff than the meff i gots.", "is_trusted": false, "is_verified": false, "num_reviews": 1, "num_stars": 5, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_b28ODaG.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/ExpressService", "tagline": "Established vendor for 73% high class Speed Paste, 84% high quality MDMA and Cialis generics", "details": "⚡⚡⚡SPECIAL OFFER⚡⚡⚡\r\n\r\nWe have a SPECIAL OFFER for you: \r\n\r\nFor every purchase of our Speed listings from 10g - 50g you will get a 0.5g sample from our high quality MDMA crystals FOR FREE!\r\n\r\nIf you order Speed paste from 100g - 1000g we give you 1g finest MDMA crystals FOR FREE!\r\n\r\nThis offer is active for the next 14 days (up to 31th of May).\r\n\r\nTeam ExpressService\r\n__________________\r\nIMPORTANT INFORMATION:\r\n\r\nTomorrow on Tuesday, 04th April we are going to vacation mode. We are missing a packer and we need time now to hire somwone trustworthy to support us by speeding up the delivery process to provide you with a more satisfying shopping experience again.\r\nWill will open our doors again in 2-3 weeks.\r\n\r\nEvery open order will be sent out until tomorrow evening!\r\nOne of the staff member will answer all messages regarding open orders. Other messages will be answered when we are back again. \r\n\r\nHave a good time\r\n\r\nTeam ExpressService\r\n__________________\r\n23.03.23 NEW PRODUCT ON STOCK!!\r\n\r\nA couple of weeks ago we have announced that we will list MDMA crystals soon.\r\nNow we finally have received high class MDMA, which contains only big rocks, no powder!\r\n\r\nListings will be added until tomorrow.\r\n\r\nTeam ExpressService\r\n__________________\r\n\r\n10.03.2023 \r\n\r\nDear customers, \r\n\r\nnow the days are becoming warmer, the birds are chirping and everyone gets happier.\r\nTo make you happy additionally, we offer a 20% coupon code for ALL OF YOU!!! The code is valid until April, 15th.\r\n\r\nJust type in the coupon code \"P6DW2KY\" during your next order and you'll get 20% discount to every order!!\r\n\r\nRegards Team ExpressService\r\n__________________________\r\n\r\n27.02.2023 \r\n\r\nALL OPEN ORDERS HAS BEEN SENT YESTERDAY AND TODAY. \r\n\r\nYou should receive domestic order until Friday. Abroad order in the beginning of next week.\r\n\r\nProblems with the supplier has been finally fixed and we are now stocked up!\r\n\r\nSORRY FOR THE INCONVIENCE\r\n\r\nTeam ExpressService\r\n__________________\r\n13.02.2023\r\n\r\nWe have issues with our supplier (waiting for new batch), so there will be shipping delay. But everyone of you will receive his goods, for sure!\r\nWe will receive the delivery a couple of days later than expected and the stuff will be sent out as soon as we have received it.\r\n\r\nTeam ExpressService\r\n__________________\r\n24.01.2023\r\n\r\nDear customers:\r\n\r\nCurrently there is a German-wide postal strike, so all order could be delayed. \r\n\r\nTeam ExpressService\r\n_________________\r\nHi,\r\n\r\nwe are ExpressService and we bring you with our Speed & Magic Mushrooms to a new psychedelic level. We were growing the mushrooms by our own to guarantee the highest possible quality for a incredible psychedelic experience.\r\n\r\nOffline and online we are active for quite a while, so we have collected a lots of experience during our time as a vendor. You can check our reputation on my Recon and Darknet Trust profiles.\r\n----------------------------------------------------------------------------------------------------\r\n\r\nWhat you can expect from us:\r\n\r\n- fast delivery\r\n- solution-oriented communication\r\n- first-class price/performance ratio\r\n- High Quality Stuff\r\n----------------------------------------------------------------------------------------------------\r\n\r\nProducts in stock:\r\n\r\nHigh Quality Uncut Speed Paste : Extreme strong Speed for a very clean high and an awesome euphoric feeling. USE WITH CAUTION!!\r\n\r\n- 50mg for beginners and 100mg for experienced user are good dosages for the beginning\r\n\r\nMagic Mushrooms: We have three of the strongest Magic Mushrooms in stock.\r\n\r\n- Golden Teacher: strength 4,5/5\r\n- Mexican: strength 4/5\r\n- Columbian: 4,5/5\r\n-------------------------------------------------------\r\n\r\nPrices:\r\n---------------------------------\r\n\r\nMagic Mushrooms (every sort):\r\n\r\n- 1g = 7€\r\n- 2g = 13,5€\r\n- 3g = 19,5€\r\n- 5g = 30€\r\n- 10g = 55€\r\n-----------------------------\r\n\r\nSpeed:\r\n\r\n- 2g = 7€\r\n- 5g = 16€\r\n- 10g = 31€\r\n- 20g = 58€\r\n- 50g = 130€\r\n- 100g = 220€\r\n- 200g = 410€\r\n-------------------------------------------------------------------", "policy": "Shipping costs:\r\n\r\n- DE without tracking = 4.5€\r\n- DE with tracking = 7€\r\n- EU without tracking = 8€\r\n- EU with tracking = 16€\r\n----------------------------------------------------------------------------------------------------\r\n\r\nOrder/Delivery:\r\n\r\n\r\n- All orders are shipped from Germany!\r\n\r\n- We ship from Monday to Friday\r\n\r\n- We ship to all countries of Europe!\r\n\r\n- Processed orders will be shipped within 24h!\r\n\r\n- You will get a short info when the package is on its way to you!\r\n\r\n- The delivery within Germany usually takes 1-3 working days. To Europe it may take 4-7 working days. Please ask for the rest of your package only after this time has passed :-)!\r\n\r\n- You are responsible for the correctness of the address data. I take care of this in the copy&paste procedure, so the error rate on my part is zero.\r\n\r\n- Orders from 200g and above will be automatically send with DHL!\r\n\r\n\r\nCorrect address data:\r\n\r\nFirst and last name\r\nStreet + house number\r\nZip code + City\r\nCountry (only for foreign delivery)\r\n----------------------------------------------------------------------------------------------------\r\n\r\nPayment:\r\n\r\n- accepted are only XMR, due to its anonymity and low transaction fees.\r\n-------------------------------------------------------------------\r\n\r\nReturn Agreement:\r\n\r\n- If you order by tracking, you will receive either a 50% refund of the purchase price or 100% reship if the goods do not arrive, if not negligent by you!\r\n\r\n- Without Tracking there is no refund. Returning customers are excluded, in this case we will act at my discretion!\r\n\r\n- Shipments to DHL Packstations are always possible, but with only 50% refund and no reship!", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["DE"], "ships_to": ["AT", "BE", "CZ", "DE", "DK", "EE", "ES", "FI", "FR", "GR", "HR", "HU", "IE", "IT", "LI", "LU", "LV", "NL", "NO", "PL", "PT", "SE", "SI", "SK", "SM"], "avatar": "/uploads/avatar_eCI9dUT.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Gambetta", "tagline": "Gambettas Fraud Shop", "details": "Veteran Fraud Vendor, Supplying high level cards among other private stocks", "policy": "", "is_trusted": false, "is_verified": false, "num_reviews": 1, "num_stars": 5, "disputes": null, "ships_from": [], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/gh0stuk", "tagline": "Well respected and trusted UK-UK vendor.", "details": "We are the official gh0st team. With over 500+ successful sales and 200+ 5 star reviews on other platforms, we're finally ready to move onto bigger markets. We pride ourselves on only the best quality and prices around. With Tracked24 shipping and a very generous T&C you have nothing to worry about ordering with us you're in safe hands here.\r\n\r\nWe have everything to keep the party going, from Indian Shard Ketamine to our infamous washed Mephedrone, we will keep you partying from Thursaday to Monday!\r\n\r\n- the gh0st team", "policy": "If using T24 after 14 days of no arrival it will be considered lost, and a full reship will be given.\r\nIf using 1st Class no reship or refund will be given.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["GB"], "ships_to": ["GB"], "avatar": "/uploads/avatar_8TIQDk1.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/GoodtimesCafe", "tagline": "Welcome to the Goodtimes !", "details": "~ Goodtimes Cafe ~\r\n\r\nCome check out GoodtimesCafe on Drugula. We just loaded up our shop with some serious gas. We do FREE shipping on all orders. For all bulk orders please send us a message on the market. And yes, all the picture on the listings are very real and current. Enjoy!\r\n\r\n***** LIMITED TIME PROMO *****\r\n\r\n***** +FREE 1G EXTRA (3g minimum)  *****\r\n\r\nREAL 100% COLOMBIAN LAVADA COCAINE (3x Washed)\r\nUNCUT 95% COLOMBIAN COCAINE! \r\nPEARL WHITE FISHSCALES! \r\nBEST QUALITY FOR THE LOWEST PRICES \r\nFREE SAME DAY SHIPPING ON ALL ORDERS \r\n\r\n\r\n☑️ Best Quality & Purity\r\n\r\n☑️ Fast Shipping\r\n\r\n☑️ Excellent Stealth\r\n\r\n☑️ Great Customer Service\r\n\r\n\r\nRemember to give us some feedback on your way out. Thanks!\r\n\r\n*** If you got any questions or concerns let me know right away. We will figure it out.\r\n\r\n\r\n- - - - - - - - - - - - - - - - - - - \r\n CUSTOMER SUPPORT \r\n- - - - - - - - - - - - - - - - - - - \r\n\r\nAll messages will be answered within 24 hours. For all order related questions, title needs to just include the Order # and Purchase Date, and we will be able to assist you right away. For all feedback and reviews please leave those in your orders comments only, not our inbox. \r\n\r\n\r\n- - - - - - - - - - - - - - - - - - - \r\n           SHIPPING \r\n- - - - - - - - - - - - - - - - - - - \r\n\r\nPlease remember to encrypt all messages and shipping information. Must use the following shipping address format when ordering, otherwise your order will be canceled:\r\n\r\n\r\nFULL NAME.\r\nSTREET ADDRESS.\r\nUNIT.\r\nCITY. STATE. ZIPCODE.", "policy": "☑️ Best Quality & Purity\r\n\r\n☑️ Fast Shipping\r\n\r\n☑️ Excellent Stealth\r\n\r\n☑️ Great Customer Service\r\n\r\n\r\nRemember to give us some feedback on your way out. Thanks!\r\n\r\n*** If you got any questions or concerns let me know right away. We will figure it out.\r\n\r\n\r\n- - - - - - - - - - - - - - - - - - - \r\n CUSTOMER SUPPORT \r\n- - - - - - - - - - - - - - - - - - - \r\n\r\nAll messages will be answered within 24 hours. For all order related questions, title needs to just include the Order # and Purchase Date, and we will be able to assist you right away. For all feedback and reviews please leave those in your orders comments only, not our inbox. \r\n\r\n\r\n- - - - - - - - - - - - - - - - - - - \r\n           SHIPPING \r\n- - - - - - - - - - - - - - - - - - - \r\n\r\nPlease remember to encrypt all messages and shipping information. Must use the following shipping address format when ordering, otherwise your order will be canceled:\r\n\r\n\r\nFULL NAME.\r\nSTREET ADDRESS.\r\nUNIT.\r\nCITY. STATE. ZIPCODE.\r\n\r\n\r\n - - - - - RESHIPS / REFUNDS - - - - - \r\n\r\nTrackings will only be given out if package is late and is not delivered yet. Will not be given before. If there are any issues with the order, you must contact first abouot the issue. Dont rush to a dispute first, we will figure it out. If our fault then we will either reship or reimburse accordingly.", "is_trusted": false, "is_verified": true, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_fYAVMe2.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/greenpirate", "tagline": "seeds,buds,shakes", "details": "greenpirate\r\n\r\n- i am a small time grower i would like to help some people to get small quantity marihuana for own uses grown without chemicals.\r\nplease dont ask for big quantities. (5 grams is the max).\r\n\r\n\r\n-Autoflowering marijuana seeds \r\nproduce plants that begin their flowering at a certain age regardless of the light hours received, meaning they can be harvested following the  schedule of the grower. This has been achieved by selective crossing with the cannabis strain Ruderalis. These varieties give you the chance to harvest on the date that you choose.\r\n\r\n\r\n\r\n  \r\n\r\n- when there is a question abouth an order always give order ID so its easy to look back ,thanks \r\n\r\n\r\n- for growing advice i am always willing to give tips i am a long time grower\r\n\r\n- tip    \r\n1-  use the autoflower seeds for outside growing so you dont have to worry abouth the hours of light.\r\n\r\n2- use the normal feminized seeds for inside growing because there you decide the hours of light.\r\n\r\n\r\n- ship from eu     \r\n\r\n\r\n\r\nthe shake i sell is made of trimmings and  small buds blended perfect to make cbd thc oil     tea     spacecake   to roll  joints with instead of tobacco.\r\n\r\n\r\nall package are sealed  and packed with highest care.\r\n\r\ndelivery time mostly 1 to 2 weeks \r\n\r\n\r\n- cannabis is helping many people worldwide with medical isseus and i am happy to see that goverments slowly are waking up and its uses get accepted more.\r\n\r\n- please put correct adres.\r\n\r\nname\r\nstreet name and House number\r\npostalcode City\r\ncountry", "policy": "reship in case of a missing package", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": [], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA"], "avatar": "/uploads/avatar_g49l9sf.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Growrilla", "tagline": "We sell Weed and Magic Mushrooms in Germany", "details": "🌴Herzlich Willkommen im Growrilla Shop🦍🌴!\r\n\r\nIhr habt die Schnauze voll von gestreckten und chemisch schmeckenden Weed🥦 ?\r\nDann seid ihr hier genau richtig💯!\r\nBei uns gibt es zu 100% ungestrecktes Weed🥦 und Pilze🍄.\r\nAlles bei uns im Shop ist selber gezuechtet🦍✂️🍄🌳, dadurch koennen wir euch eine TOP Qualitaet👌 liefern. \r\n\r\n📰News📰:\r\nB+ Promo\r\n-\r\n-\r\n\r\n✉️Versand✉️:\r\n1. Wir versenden nur innerhalb Deutschlands🇩🇪.\r\n2. Alle bestellungen die bis 13 Uhr eingehen, werden noch am selben Tag verschickt.\r\n3. Wir verschicken max. 25gr pro Brief✉️ aus Sicherheitsgruenden\r\n3. Versanddauer 1-4 Tage innerhalb Deutschlands🇩🇪.\r\n4. Alle Daten werden nicht gespeichert🦍🗑\r\n5. Bitte die Addresse in diesem Format senden.\r\n\r\n    Vorname Nachname\r\n    Strassenname Hausnummer\r\n    Postleitzahl Ort\r\n\r\n📜Reship📜:\r\n1. Bei der ersten Sendung gibt es 25% Reship.\r\n    Danach gibt es 50% Reship.\r\n2. Stammkunden kriegen 100% Reship", "policy": "📜Reship📜:\r\n1. Bei der ersten Sendung gibt es 25% Reship.\r\n    Danach gibt es 50% Reship.\r\n2. Stammkunden kriegen 100% Reship", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["DE"], "ships_to": ["DE"], "avatar": "/uploads/avatar_JYWXTwY.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/GungaDin", "tagline": "Spread Love And Light To All", "details": "*******************************************************************\r\nOUR BEAUTIFUL FRIENDS/FAMILY\r\n\r\nWE ARE HAPPY TO ANNOUNCE A 10% DISCOUNT ACROSS ALL OUR LISTINGS FOR A LIMITED TIME. TELL YOUR FRIENDS, TELL THE WORLD. LETS SPREAD SOME LOVE!!\r\n\r\nMUCH LOVE\r\nGUNGA\r\n*******************************************************************\r\n\r\n****\r\n\r\nAbout Us\r\n\r\nGreetings travelers! GungaDin welcomes you!\r\n\r\nWe aim to provide the best possible service with prices that we feel are right for the buyer.\r\n\r\nWe feel psychedelics are a important tool that the ecosystem needs and getting it to the people who need it is our goal.\r\n\r\nWe also want people to be educated and remain safe in using psychedelics, so we have provided some detailed information in the listings to inform our customers, and we are always available to answer any questions you might have.\r\n\r\nPlease also create an account at The Majestic Garden and be part of their great community. There is a lot of information there and many wonderful humans continue to add their knowledge each day. This is a valuable resource for any fellow psychonauts!\r\n\r\nWe are also verified vendors there, so you can check out our Vendor thread for reviews and feedback, as well as our feedback section here, and even leave some yourself.\r\n\r\n****\r\n\r\n\r\nPGP and OPSEC\r\n\r\nDance Like nobody is Watching. Encrypt like everybody is!\r\n\r\nPlease take care of your OPSEC!\r\n\r\nPlease use PGP in ALL messages. Any messages without encryption will be deleted without reading, and any orders placed without encryption will be rejected.\r\n\r\nPGP is there for everyone's safety and GungaDin only wants the best for his buyers and the marketplace he vends on.\r\n\r\n****\r\n\r\nShipping Times\r\n\r\nA First Class UK domestic order, placed on Monday, before 3pm, will most likely arrive on Tuesday afternoon, if not, Wednesday morning. On rare occasions there are delays with Royal Mail themselves and things dont get there for 3 or 4 days, but in general NDD or 2DD is a good estimate. We do ask that you please wait at least 5 days before contacting us about a package which has not landed.\r\n\r\n****\r\n\r\nPackaging And Stealth\r\n\r\nWe take packaging and stealth very seriously. We'd even go as far to say that it is something we enjoy doing. Its all part of the fun! Everything will be vacuum sealed, and disguised with various stealth techniques, appropriately packaged, and professionally labeled. We do this for the safety of not only our customers, but for ourselves as well. We cant discuss our stealth methods here and please don't ask. If you have ordered from us, we ask you to kindly not share the methods with others.\r\n\r\n****\r\n\r\nMailing Methods\r\n\r\nWe currently only ship within the UK and EU. Packs will be sent with Royal Mail 1st Class stamps.\r\n\r\nThe correct format for UK addresses is:\r\n\r\nYour Name\r\n(House Number) Street Name\r\nTown\r\nCounty\r\nPOSTCODE\r\n\r\nThe correct format for EU addresses is:\r\n\r\nYour Name\r\n(House Number) Street Name\r\n(Zip Code) City/Locality\r\nCOUNTRY\r\n\r\nIf you do not know the correct format of your address, please check it at the Royal Mail website before placing your order.\r\n\r\n****\r\n\r\nReship Policy\r\n\r\nWe judge each dispute on a case by case basis and there is no reason why your letter has not arrived unless it has been lost or stolen.\r\n\r\nWe cant offer refunds or reships for first time buyers with us, or buyers under 3 transactions. However, If you are willing to be polite and courteous we will always try our best to make sure you walk away happy with your purchase.\r\n\r\nWe will not entertain any buyer who states our tabs are under-dosed. If anything all our tabs have a heavy lay so if you come to us saying My tabs did not work then you are trying to scam the system. We don't sell anything we would not take ourselves, and our reputation over the years speaks for itself.\r\n\r\n****\r\n\r\nCan I have my tracking number?\r\n\r\nTracking will not be offered on UK listings. Royal Mail has proven very reliable, and it is simply not required for when sending this type of product.\r\n\r\nWe will however review inquiries for tracking bulk orders. Starting at 2500 tabs. \r\n\r\n****\r\n\r\nSamples\r\n\r\nWe never give away free product on request, however, from time to time we chuck in free tabs to loyal customer.\r\n\r\n****\r\n\r\nFeedback\r\n\r\nAs stated. We do not do this for financial gain. We do this as we believe its our journey to provide mind opening tools. We LOVE to read your feedback and its something that drives us on and helps us in our mission. It also helps others to see that our service is one they can trust.\r\n\r\nIf you do have any reason to leave bad feedback, please message us directly to discuss your issue before posting it. We are here to help, and we pride ourselves on sending each and every customer away with a smile on their face and a tab in their tummy.\r\n\r\n****\r\n\r\nWe are looking forward to taking your orders and spreading these healing molecules to the world!\r\n\r\nMuch love and Respect\r\nGunga\r\n\r\n****", "policy": "Reship Policy\r\n\r\nWe judge each dispute on a case by case basis and there is no reason why your letter has not arrived unless it has been lost or stolen. \r\n\r\nWe cant offer refunds or reships for first time buyers with us, or buyers under 5 transactions. However, If you are willing to be polite and courteous we will always try our best to make sure you walk away happy with your purchase. \r\n\r\nWe will not entertain any buyer who states our tabs are under-dosed. If anything all our tabs have a heavy lay so if you come to us saying \"My tabs did not work\" then you are trying to scam the system. We don't sell anything we would not take ourselves.\r\n\r\n****", "is_trusted": false, "is_verified": false, "num_reviews": 3, "num_stars": 5, "disputes": null, "ships_from": ["GB"], "ships_to": ["DE", "FR", "GB"], "avatar": "/uploads/avatar_vul4t73.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/HappyShopOrigi", "tagline": "HappyShopOrigi1", "details": "Hello", "policy": "", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_PauP4QV.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/hellbin", "tagline": "", "details": "bienvenue sur le shop  /  welcome to the shop\r\nmore than 1K sales in market\r\nproduit proposé / proposed product\r\n-MDMA\r\n-XANAX\r\n-XTC\r\n-3MMC\r\n-KETAMINE needle\r\n-KETAMINE sugar\r\n-2cb\r\n-LSD\r\n-Codeine\r\n-Modafinil\r\n\r\nfR-FR suivi \r\neurope untracked\r\n\r\n\r\n\r\n\r\nN'hésitez pas à envoyer un message en cas de question.\r\n\r\n\r\nDès que vous recevez votre commande merci de finaliser la commande le plus vite possible et de laisser un feedback ça fait plaisir et ça ne prend pas de temps\r\n\r\nS'il y a un problème de commande contactez moi\r\n\r\n\r\nEnglish:\r\n\r\nFeel free to send a message if you have any questions.\r\n\r\n\r\nAs soon as you receive your order, please finalize the order as soon as possible and leave a feedback, it's nice and it doesn't take time", "policy": "N'hésitez pas à envoyer un message en cas de question.\r\n\r\n\r\nDès que vous recevez votre commande merci de finaliser la commande le plus vite possible et de laisser un feedback ça fait plaisir et ça ne prend pas de temps\r\n\r\nS'il y a un problème de commande contactez moi\r\n\r\n\r\n\r\nEnglish:\r\n\r\nFeel free to send a message if you have any questions.\r\n\r\n\r\nAs soon as you receive your order, please finalize the order as soon as possible and leave a feedback, it's nice and it doesn't take time\r\n\r\nSHIPPPING\r\n\r\nWe sent 5 day a week only from France for the moment. Domestic shipment are tracked 100% reship if not delivered on the follow-up after 14 days. tracking are given in case of dispute so 14 day after shipping\r\n\r\n\r\nEU order are non tracked for the moment if there is problem we will see case by casebut wait 21 asking before reship\r\n\r\nUK and switzerland nontracked and no reship or refund thanks\r\n\r\n\r\n\r\nAny wrong address excludes any reship.\r\n\r\nWe are not responsible for delivery times of La Poste\r\n\r\nANY ADDRESS NOT ENCRYPTED WITH PGP = order refused", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["FR"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_7yDGiOu.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Herbalist", "tagline": "European cannabis grower", "details": "Cannabis vendor in Spain.\r\n\r\nThis is a part time operation, expect deliveries to be handled out Monday-Fridays only. Orders are shipped vacuum sealed with mylar, parcels cannot be investigated without opening and disassembling the entire package. \r\n\r\nUnfortunately, I am no longer shipping to the UK due to custom regulations. If you live in the UK you should order from domestic vendors.\r\n\r\nThese are straight from farm products without middle men. That means I know the information about the grow conditions and pesticide use as they are stated on the product pages.\r\n\r\nI keep order information for 4 weeks after delivery in case of disputes until deleted.\r\n\r\nFeel free to send suggestions for strains to grow. I consider all requests even if I don't have the ability to grow all.", "policy": "Lost packages resent once only, no refunds.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["ES"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_jzII8GO.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Her_Royal_Highness_", "tagline": "ʕु-̫͡-ʔु”♬", "details": "!!!Dear buyers, I was not able to process some of your orders due to some issues that are resolved now. If your order was missed, please place it again.!!!\r\n\r\n\r\nʕ•ᴥ•ʔ \r\n\r\nExcellent communication. Product **100% authenitc** and supplied by the cartel. *You won't find better product for the price.* ***I promise!*** \r\n\r\n - 24-hour customer service\r\n - Product **100% authentic**\r\n - Primo level product from the cartel\r\n - Speedy delivery\r\n - Creative and innovative way of stealth packaging to ensure *only  \r\n   the buyer* can find the product within the package he/she  \r\n   receives.\r\n\r\n𝕳𝖊𝖗 𝕽𝖔𝖞𝖆𝖑 𝕳𝖎𝖌𝖍𝖓𝖊𝖘𝕾 ✍", "policy": "Delivery failures that are not the fault of the customer will be replaced immediately. *I go above and beyond assuring delivery.*\r\n\r\n                        ਏਓॱ⋅.˳˳.⋅˙ॱᐧ.˳˳.⋅             \r\n\r\nIndications for shpping time (in business days):\r\n\r\n    USA = 2-5\r\n    Australia = 10-15\r\n    Rest of the world = 18-25\r\n\r\n\r\n(ں•ᴥ•)♡", "is_trusted": false, "is_verified": false, "num_reviews": 3, "num_stars": 5, "disputes": null, "ships_from": ["US"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_cOp9nXW.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/HeyZeus.Hydro", "tagline": "High Quality. High Vibes.", "details": "Welcome to HeyZeus Hydro! We are the premier destination for premium quality, small batch artisan cannabis flower. We understand the importance of providing our customers with only the highest quality flower, and we take special care to make sure each and every strain is grown with precision and attention to detail. From Indica to Sativa, and Hybrid varieties, our selection of premium flowers has something for everyone. Visit us today and find out why HeyZeus Hydro is considered the best in the business when it comes to small-batch artisan cannabis flower!", "policy": "At HeyZeus Hydro, we are committed to providing our customers with the highest quality products and a satisfactory shopping experience. We offer reliable US-US shipping via USPS, and packages over 7g and over can be tracked via Informed Delivery. \r\n\r\nIn the unlikely event that a package is not delivered due to our error, we will do a 100% reship or a 100% refund – your choice. If a package cannot be delivered due to a buyer or USPS error, we will offer a discount of 20% off your next order. \r\n\r\nWe take pride in our product and our level of service and hope you have a positive experience with HeyZeus Hydro!", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_UqCZWm4.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Howardmarks", "tagline": "UK-UK Cannabis Cup grade farm", "details": "Howardmarks standards for organic weed grown with love and care. I treat my plants with Organic feeds at low levels and flushed to full removal, producing the most smooth, paranoia free weed that burns to clean ash and doesn't give you a nasty cough or hangover the next day.\r\n\r\nMy focus is THC crystal quality and THC density within the buds, this is what sets average weed apart from world class Cannabis Cup grade. I have been progressing from a weed grower to a Cannabis Scientist of late on my journey to grow the finest smoke in the world. Expect not just a high from my weed but a real euphoric relaxing experience that will melt the stress of your day into complete oblivion.\r\n\r\n\r\nI have been growing weed for over 2 decades and on DNM for over 3+ years. Please see my Recon score for reputation and in case this site becomes inaccessible you can contact me on Dread forums /d/howardmarks sub forum.\r\n\r\nI ship typically top buds only for my A-grade listings meaning more THC as these buds are closest to the light.\r\n\r\nMany of my offline clients have been with me for years and it seems my online clients are following suit. Please come on in and enjoy the Howardmarks experience as I cultivate from seed, grow and pack your weed for dispatch. You are dealing with the old hippy direct my friends :)\r\n\r\nPeace and love to you all. Howard", "policy": "All orders shipped same day before 12PM deadline.  My typical delivery is 1DD by RM 1st class stealth.\r\n\r\nRe-ship 50% if you have ordered 3 times from me.\r\n\r\nI had one missing pack in 2021 and a single missing pack in 2022 to give you an idea of my delivery failure rate.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["GB"], "ships_to": ["GB"], "avatar": "/uploads/avatar_nIVnNKf.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/icetropy", "tagline": "icetropy", "details": "- icetropy -\r\n\r\nWelcome to our shop.\r\n\r\nOld school seller with real quality products and top professional safe shipping methods.\r\nWe are a team with years of experience of shipping around the DW.\r\nOur mission is to build a solid reputation.\r\nWe ship from UK to WORLDWIDE\r\nWe offer the best stealth / decoy - fast reply service 7/7 - Next day / Same day shipment - Great refund / reship policy\r\nSend us a message with any questions / requests or\r\nJust place your order and it will be shipped in the following hours of the same day!!\r\nOnline every day\r\n\r\nTop quality products\r\nProfessional vacuum packing\r\nDouble/Triple sealed\r\nDog Smell Proof 100%\r\nX-Ray Stealth Methods\r\nMylar Bags\r\nDifferent decoy/Best shipping methods\r\n\r\n\r\nPreferred PGP use\r\n\r\nPlease provide a full shipping address!\r\nExample:\r\n\r\nName Surname,\r\nStreet Address,\r\nCity, Country, Postcode\r\nState", "policy": "30% Reship\r\nor\r\n30% Refund", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["GB"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_HPYHEQx.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/kanemoto", "tagline": "Discover the latest digital goods with Kanemoto - your one-stop shop for all things cyber.", "details": "Welcome to Kanemoto's DarkNet Vendor Shop! We offer a wide range of digital goods including invite codes, software,. books, and other digital goods. Our shop is your one-stop destination for all things cyber.", "policy": "All goods will be delivered electronically.\r\nIt is done manually for now, so if your order has not arrived in 24-72 hours, please message me.\r\nIf it is a digital download, and you don't specify which service you would like to download the files from, I'll chose one myself.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": [], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_aNwuR7S.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/KantFr", "tagline": "All drugs", "details": "En Français deuxième partie.\r\n----------------------------------\r\nWelcome to our online store.\r\n\r\nWe offer a wide range of products at prices related to quality. \r\n\r\nMost of the weed are from French agriculture. \r\nThe drugs are for the most part from French and European Pharmacies. \r\n\r\nTo order: \r\n\r\n***Indicate your contact information as below***\r\n\r\nName, First name\r\nAddress\r\nPostal code, City\r\nCountry \r\n\r\nWe do our best to answer all your messages within 48 hours (working days).\r\nOrders are shipped the next day or on Monday if ordered on Friday. \r\n\r\nWe note an increase in delivery time for all shipments. \r\nThe post office announced at the beginning of the year that it was no longer possible to receive mail within 24-48 hours. \r\n\r\nTherefore, we have to extend our delivery times to meet the new constraints of the post office.  \r\n\r\nWe currently note : \r\n\r\nFrance --> France = 3 to 7 days\r\nFrance --> Europe = 4 to 15 days\r\nFrance --> WorldWide = 9 to 30 days (depending on the country)\r\n\r\nIn order to be sure to receive your package or the refund of it, we set up 3 delivery options. \r\n\r\n-The first one with tracking for France. \r\n-The second with tracking for the WorldWide. \r\n-The third is an insurance, allowing to have a refund of the order if not received after a second reshipment. \r\n\r\nWe hope to be able to satisfy our customers following the changes made by the post office. \r\n\r\nI remind you that we are present and connected from :\r\nMonday to Friday once a day and on each market. \r\n\r\nYour weekend orders are therefore processed on Monday morning. \r\n\r\nWe no longer give the tracking number to customers. \r\nThis is to ensure the safety of our teams and to be able to offer you this service in time. \r\n\r\nIn case of dispute, if the tracking has not activated or there is a problem. I will indicate that I will reship your order. \r\nBy taking the insurance, if the package does not arrive after the second reshipment, I commit myself to refund you. \r\n\r\nWe truly strive for customer satisfaction and understand the stress of purchasing our products.\r\nHowever, a negative review, blackmail, threats and we will close like an oyster. \r\nTo resolve disputes, I ask everyone to be respectful and polite. \r\n\r\nBest regards, KantFr\r\n\r\n==================\r\n\r\nBienvenue sur notre boutique en ligne. \r\n\r\nNous proposons une large gamme de produits à des prix en liens avec la qualité. \r\n\r\nLa plupart des herbes sont issues de l'agriculture Française. \r\nLes médicaments sont issus de Pharmacies Françaises et Européens. \r\n\r\nPour commander : \r\n\r\n***Indiquez vos coordonnées comme ci-dessous***\r\n\r\nNom, Prénom\r\nAdresse\r\nCode Postal, Ville\r\nPays \r\n\r\nNous fesons tous notre possible pour faire répondre à l'ensemble de vos messages dans un délais de 48h (jours ouvret).\r\nLes commandes sont expédiés le lendemain ou le lundi si commandé le vendredi. \r\n\r\nNous notons sur l'ensemble des expéditions une augmentation du temps de livraison. \r\nLa poste a annoncé en début d'année qu'il n'était plus possible de recevoir son courrier sous 24-48h. \r\n\r\nPar conséquent, nous devons allonger nos temps de livraison pour répondre aux nouvelles contraintes de la poste.  \r\n\r\nNous constatons actuellement : \r\n\r\nFrance --> France = 3 à 7 jours\r\nFrance --> Europe = 4 à 15 jours\r\nFrance --> WorldWide = 9 à 30 jours (suivant les pays)\r\n\r\nAfin d'être sûr de recevoir votre colis ou le remboursement de celui-ci, nous mettons en place 3 options de livraisons. \r\n\r\n-La première avec suivi pour la France. \r\n-La seconde avec suivi pour le WorldWide. \r\n-La troisième est une assurance, permettant d'avoir un remboursement de la commande si non reçu après un second reship. \r\n\r\nNous espérons pouvoir satisfaire ainsi les clients suite aux modifications apportées par la poste. \r\n\r\nJe rappelle que nous sommes présents et connectés du :\r\nLundi au vendredi une fois par jour et sur chaque market. \r\n\r\nVos commandes du week-end sont donc traités le lundi matin. \r\n\r\nNous ne donnons plus le numéro de suivi aux clients. \r\nCeci afin d'assurer la sécurité de nos équipes et pouvoir vous offrir ce service dans le temps. \r\n\r\nEn cas de litige, si le suivi ne s'est pas activé ou qu'il y a un problème. J'indiquerais que je reship votre commande. \r\nEn prenant l'assurance, si le colis n'arrive pas après le second reship, je m'engages à vous rembourser. \r\n\r\nNous cherchons véritablement à satisfaire nos clients et comprenons le stress lié à l'achat de nos produits.\r\nCependant, un avis négatif, du chantage, des menaces et nous nous fermerons comme une huître. \r\nPour résoudre les litiges, je demande à chacun le respect et la politesse. \r\n\r\nA bientôt,\r\nCordialement, KantFr", "policy": "En Français deuxième partie.\r\n----------------------------------\r\nWelcome to our online store.\r\n\r\nWe offer a wide range of products at prices related to quality. \r\n\r\nMost of the weed are from French agriculture. \r\nThe drugs are for the most part from French and European Pharmacies. \r\n\r\nTo order: \r\n\r\n***Indicate your contact information as below***\r\n\r\nName, First name\r\nAddress\r\nPostal code, City\r\nCountry \r\n\r\nWe do our best to answer all your messages within 48 hours (working days).\r\nOrders are shipped the next day or on Monday if ordered on Friday. \r\n\r\nWe note an increase in delivery time for all shipments. \r\nThe post office announced at the beginning of the year that it was no longer possible to receive mail within 24-48 hours. \r\n\r\nTherefore, we have to extend our delivery times to meet the new constraints of the post office.  \r\n\r\nWe currently note : \r\n\r\nFrance --> France = 3 to 7 days\r\nFrance --> Europe = 4 to 15 days\r\nFrance --> WorldWide = 9 to 30 days (depending on the country)\r\n\r\nIn order to be sure to receive your package or the refund of it, we set up 3 delivery options. \r\n\r\n-The first one with tracking for France. \r\n-The second with tracking for the WorldWide. \r\n-The third is an insurance, allowing to have a refund of the order if not received after a second reshipment. \r\n\r\nWe hope to be able to satisfy our customers following the changes made by the post office. \r\n\r\nI remind you that we are present and connected from :\r\nMonday to Friday once a day and on each market. \r\n\r\nYour weekend orders are therefore processed on Monday morning. \r\n\r\nWe no longer give the tracking number to customers. \r\nThis is to ensure the safety of our teams and to be able to offer you this service in time. \r\n\r\nIn case of dispute, if the tracking has not activated or there is a problem. I will indicate that I will reship your order. \r\nBy taking the insurance, if the package does not arrive after the second reshipment, I commit myself to refund you. \r\n\r\nWe truly strive for customer satisfaction and understand the stress of purchasing our products.\r\nHowever, a negative review, blackmail, threats and we will close like an oyster. \r\nTo resolve disputes, I ask everyone to be respectful and polite. \r\n\r\nBest regards, KantFr\r\n\r\n==================\r\n\r\nBienvenue sur notre boutique en ligne. \r\n\r\nNous proposons une large gamme de produits à des prix en liens avec la qualité. \r\n\r\nLa plupart des herbes sont issues de l'agriculture Française. \r\nLes médicaments sont issus de Pharmacies Françaises et Européens. \r\n\r\nPour commander : \r\n\r\n***Indiquez vos coordonnées comme ci-dessous***\r\n\r\nNom, Prénom\r\nAdresse\r\nCode Postal, Ville\r\nPays \r\n\r\nNous fesons tous notre possible pour faire répondre à l'ensemble de vos messages dans un délais de 48h (jours ouvret).\r\nLes commandes sont expédiés le lendemain ou le lundi si commandé le vendredi. \r\n\r\nNous notons sur l'ensemble des expéditions une augmentation du temps de livraison. \r\nLa poste a annoncé en début d'année qu'il n'était plus possible de recevoir son courrier sous 24-48h. \r\n\r\nPar conséquent, nous devons allonger nos temps de livraison pour répondre aux nouvelles contraintes de la poste.  \r\n\r\nNous constatons actuellement : \r\n\r\nFrance --> France = 3 à 7 jours\r\nFrance --> Europe = 4 à 15 jours\r\nFrance --> WorldWide = 9 à 30 jours (suivant les pays)\r\n\r\nAfin d'être sûr de recevoir votre colis ou le remboursement de celui-ci, nous mettons en place 3 options de livraisons. \r\n\r\n-La première avec suivi pour la France. \r\n-La seconde avec suivi pour le WorldWide. \r\n-La troisième est une assurance, permettant d'avoir un remboursement de la commande si non reçu après un second reship. \r\n\r\nNous espérons pouvoir satisfaire ainsi les clients suite aux modifications apportées par la poste. \r\n\r\nJe rappelle que nous sommes présents et connectés du :\r\nLundi au vendredi une fois par jour et sur chaque market. \r\n\r\nVos commandes du week-end sont donc traités le lundi matin. \r\n\r\nNous ne donnons plus le numéro de suivi aux clients. \r\nCeci afin d'assurer la sécurité de nos équipes et pouvoir vous offrir ce service dans le temps. \r\n\r\nEn cas de litige, si le suivi ne s'est pas activé ou qu'il y a un problème. J'indiquerais que je reship votre commande. \r\nEn prenant l'assurance, si le colis n'arrive pas après le second reship, je m'engages à vous rembourser. \r\n\r\nNous cherchons véritablement à satisfaire nos clients et comprenons le stress lié à l'achat de nos produits.\r\nCependant, un avis négatif, du chantage, des menaces et nous nous fermerons comme une huître. \r\nPour résoudre les litiges, je demande à chacun le respect et la politesse. \r\n\r\nA bientôt,\r\nCordialement, KantFr", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["FR"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_JRQlRjk.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/KURABLESTIM", "tagline": "TRANSPARENCY SECURITY QUALITY", "details": "Team Kustim will be shipping out orders and take shorrt breather to relax by prioritizing loyal comrades, biger orders as we have featured listing to begin as of May 24th. Team kustim have been going nonstop ship same day express for almost all packages for months and deserve take foot off pedal to metal. Please note we that we sttill try ourr best to ship express and priority same day based on batch cycle algorith priority, but comrade please respect our policy that all packages are subject to estimated 24-48 hour processing and handling period, with peak times causing this to vary. addition to this is saturdays, as time cutoffs and acceptance change per usps policy, comrade do best to order, preplan thursday and friday.\r\n\r\nPLEASE FOLLOW OUR UPDATED FORMAT FOR DROP ADDRESS FORMAT GIVEN PER ORDER, PLEASE NOT ADD ANY MESSAGE TO FIRST ORDER DETAIL MESSAGE, YOU MAY INCLUDE NOTE/MESSAGE IN SEPERATE/SECOND MESSAGE.\r\n\r\nSTILL AND ALWAYS ENCRYPTED!!! NEVER EVER SEND ANY SENSITIVE DETAILS PLAINTEXT. ENCRYPT MESSAGES YOURSELF, SHOULD NOT RELY ON SITE'S ENCRYPT MESSAGE OPTION.\r\n\r\nFOLLOW THIS FORMAT EXACTLY WITH ALL CAPS DO NOT USE COMMAS OR PERIODS\r\n>>> FOR PRIORITY PACKAGES AND EXPRESS put >>> !!FAKE NUMBER!!!<<<<, ALL EXPRESS USPS PACKAGES REQUIRES PHONE NUMBER, GIVE US A FAKE ONE, BUT IF YOU ORDER WITH US REPEATEDLY, MAKE UP PHONE NUMBER WITH AREA CODE THAT IS OF YOUR AREA AND RETAIN THIS FAKE NUMBER FOR FUTURE USE WITH THE SAME DROP WITH US.\r\n-IT IS USPS REQUIREMENT FOR PHONE NUMBER FOR EXPRESS PACKAGES. SUSPICIOUS IF PHONE NUMBER DIFFERENT EVERY TIME; THUS, IF YOU ARE REPEAT CUSTOMER WITH EXPRESS SHIPMENTS VERY OFTEN. MAKE UP FAKE NUMBER WITH RELEVANT AREA CODE, AND RETAIN FOR US TO USE IN DETAILS AS A RANDOM PHONE# EACH TIME IS NOT GOOD. For our loyal comrades who desire express, with informed delivery bypasss. opsec. team kustim work on shipping listing option that create jmp burner number for extra opsec. will give updates on this. comrades.\r\n**NO LONGER ADD THE EXTENDED ZIP CODE, JUST THE MAIN ZIP PLEASE, AND STATE CODE ONLY, NOT FULL STATE SPELLED OUT.\r\n\r\nGIVE DATA IN ONE LINE PLEASE, AND BE SURE TO HAVE SEMICOLONS INPUT CORRECTLY.\r\n\r\n>FORMAT WITH NO SECOND ADDRESS MODIFIER:\r\n\r\nFIRST NAME LAST NAME;PHONE NUMBER;FIRST ADDRESS;;;CITY;ZIP;2 LETTER STATE CODE\r\n\r\n>FORMAT WITH SECOND ADDRESS\r\n\r\nFIRST NAME LAST NAME;PHONE NUMBER;FIRST ADDRESS;SECOND ADDRESS;;CITY;ZIP;2 LETTER STATE CODE\r\n\r\n>EXAMPLE WITH NO SECOND ADDRESS MODIFIER:\r\n\r\nCHANNING TATEYUM;18085657788;6969 COMRADE BLVD;;;CITY;44143;HI\r\n\r\n>EXAMPLE OF IF COMRADE HAS SECOND ADDRESS MODIFIER SUCH AS APT #\r\n\r\nCHANNING TATEYUM;18085657788;6969 COMRADE BLVD;APT 2;;CITY;44143;HI\r\n\r\nFAILURE TO FOLLOW NEW REQUEST, WILL SLOW PROCESS DOWN AND WE WILL NOT REFUSE ORDER, BUT WILL HANDLE ORDER AFTER THE CORRECT INPUT FORMATTED ONES, danke comrades, we are allways working on how to serve our comrades better, safer, and faster without any loss of our opsec, safety, & quality service =). Our new system handle details in such way that comrade details are remain fully encrypted - ranked/sorted through batch cycle algorithm - then purged, upon extant bypass label =) we love our comraddes. you safety our happy. Always, team kustim is look for how to keep comrades safe.\r\n\r\n\r\n\r\n TEAM KUSTIM FURTHER OPSEC AND EFFICIENCY WITH ALGORITHM FORMULA FOR  OPTIMIZING OUR INFORMED DELIVERY BYPASS AND PRODUCTION OF OUR BYPASS LABELS WITH FURTHER MITIGATION OF TIME/HANDLING OF COMRADE DROP SENSITIVE DETAILS\r\n\r\nUSPS HAS BEEN HAVING GREAT DELAYS, DELAYS DUE TO CARRIER FAULT FROM ORDERS MADE AROUND MAY13, EVEN EXPRESS HAS BEEN HEAVILY DELAY, THIS DUE TO VOLUME OF PACKAGES SENT FOR DAAY OF MOTHERS. DANKE FOR PATIENCE.\r\n\r\nWE GET TO SAMPLER ORDERS WHEN WE ARE ABLE TO BAED ON BATCH CYCLE DROP RANKING.\r\n\r\nWE HAVE CHOSEN TO FURTHER RESTRICT TRANSACTIONS ON LOW AMOUNTS/FEW SUCCESSFUL ORDER NEW COMRADES AS THE TWO NEGATIVE FEEDBACK WE HAVE RECEIVED WERE FROM OBVIOUS SHILLS, BOTH SUB 25 USD ORDERS AND FROM NEW ACCOUNTS WHO LEFT NEGATIVE FEEDBACK WITHOUT ANY EXTENSION OF RECONCILE PRIOR TO NEGATIVE FEEDBACK LEFT, ALL OUR COMRADES KNOW WE GO EXTRA MILE TO SATISFY COMRADES, AND MISTAKES ARE POSSIBLE AS WE VALUE COMRADE OPSEC AND SAFETY WE STORE NO COMRADE DATA IN LAINTEXT FOR ANY PERIOD LONGER THAN NECESSARY; REACH OUT TO US IF ISSUE, WE WILL MAKE IT RIGHT, READ OUR FEEDBACK. COMRADES MAY THANK THE SHILLS FOR RUINING OUR TRUST AND HAVING TO RESTRICT ON SMALLER NEW CUSTOMERS ORDERS. \r\n\r\nSAMPLER ORDERS WILL BE ACCEPTED AT OUR CONVENIENCE PRIMARILY WITH RESPECTFUL VETTED BUYERS THAT CHECK OUR BASIC OPSEC BOXES - APOLOGIES, BUT TEAM KUSTIM HAVE FOUND THAT EVEN WITH PROVIDE SAMPLER WITH EXPRESS SHIPPING LESS THAN 30% LEAVE FEEDBACK WHICH IS WHAT WE PRIMARILY ASK FOR.\r\n>ALTHOUGHT SMALL IN IT'S AMOUNT, WE TREAT EVERY PACKAGE AS IF IT WERE OUR LAST AND AS IF EACH AND EVERY PACK WERE TO BE UNDER PI SCRUTINY, THEREFORE, THE SAME AMOUNT OF TIME, OPSEC PROCESSING/ HANDLING/PACKAGING/DNA QUALITY CHECK/STORING OCCURS NO MATTER THE AMOUNT.\r\n\r\nWANT YOUR ORDER ACCEPTED SHIPPED AND FULLFILED TO JOIN SMALL CIRCLE OF TEAM KUSTIM? PATIENCE, TRUST, RESPECT, BEGIN WITH A BIGGER ORDER.\r\n\r\nWANT $8.88 USD FIXED DISCOUNT CODE? SUBSCRIBE TO  /d/XanaxUSA on Dread, post in their giveaway thread (they're giving away free product or  reward to support the subreddit!! Then message mods for ASAP COUPON CODE! Help great community grow again! Very active friendly moderators that look after users with harm reduction and info on relevant vendors!\r\n\r\nALL PACKAGES ARE SUBJECT TO 24-48 HOURS SHIPPING AND HANDLING TIME -- TEAM KUSTIM TAKE PRIDE THAT MOST OCCURENCE IS SHIP SAME DAY IF ORDER MADE BY COMRADE WITHIN WORKING HOURS.\r\n\r\nIf you message us with message carrying a tone in a way like, \"I got free express shipping, it's been a day and hasnt marked shipped yet,\" do not expect us to accept future orders from you. We offer express shipping for FREE, do not act as if this obligates us to treat shipping and handling time as if you purchased Express, this is not amazon, what express shipping guarantees Rush or not, is that the package will be shipped with subject time of 24-48 hour processing time (peak times may increase time but usually are dropped same day if made by cutoff). Not sure what some buyers think the process of opsec shipping is like, but it is a meticulous process that cannot be rushed, steps are compartmentalized, maintaining \"sterile\" technique at all times, we process with thorough care in terms of necessity to maintain \"sterility/freedom of any footprint\", for comrade safety danke.\r\n\r\n>Those of you who treat us like a etsy amazon store, not type of comrade we like to work with, these comrade seem not have idea the meticulous process team kustim take to keep opsec for comrade safety.\r\n\r\nIf you order with us, wait patiently, if nothing appears after 5 days for express, 10 days from shipped for priority, please message us and we will take care of you gladly.\r\n\r\n**WHAT IS DIFFERENCE BETWEEN FREE EXPRESS/PRIORITY OPTION AND EXPRESS/PRIOIRITY RUSH?**\r\n\r\nBuyer must understand that team kustim operate on batch cycle drop. Will not go into detail, but know that free option is always subject to proccessing time listed above, RUSH, allows new buyer or current buyers to rise in batch cycle line in proportion to order size and loyalty (amount of previous successful transaction with team kustim) -- if comrade want more detail on batch cycle dropping and necessity of this for security and why team kustim value patient comrades find vendor/opsec faq handbook on dread the extremely detailed versiion not the cliffnoteskeleton one - we talking about one that that is over 80 pages long and still in development and has beginning footnote referring to ukraine who seek privacy black background. very good.\r\n\r\nRUSH EXPRESS DOES NOT MEAN TEAM KUSTIM ***GUARANTEE*** PACKAGE WILL BE DROPPED SAME DAY (some new comrade ask  if comrade buy rush express; there is still x amount of time b4 cutoff can package be dropped?) this immense opsec breach - no we not jeopordize sec like this\r\n\r\nComrades please finalize once order is received. We do our part in getting orders out as fast as possible, please reciprocate in the same manner as our current margins are low as we provide Free Express shipping costing 27 to 33 USD we do not charge comrade. If comrade take second to roughly calculate our  margins based on our product quality - free shipping -- comrade will find team kustim truly provide service out of passion and belief human should have access to safe transparent goods if they so please. We run off these small margins and everything go back into providing to our comrades - help us work our products more affordable - allow us to give extras - more fire sales - work on syntheses and projects by doing your part - finalize as soon as possible. Danke comrade.\r\n\r\nWhat seperate team kustim from other vendors?\r\n\r\nSAVANT INFORMED DELIVERY BYPASS - NEW META OPSEC - OUR PACKS DO NOT GET RECORDED/STORED IN USPS DATABASE PER USUAL USPS PROTOCOL - DATA AND LABELS ARE GENERATED GHOST FROM USPS API\r\n\r\nUSPS PROTOCOL IS TO RECORD AND STORE PICTOGRAPHIC INVENTORY OF EVERY PACKAGE DELIVERED - PATTERN TRACKING OF SENDER AND RECEIVER - TEAM KUSTIM HAVE BYPASS NEW META OPSEC; PACKAGES WILL NOT SHOW ON INFORMED DELIVERY, NOR WILL OUR SHIPMENTS/PACKAGES BE RECORDED/STORED IN USPS DATABASE PER USUAL PROTOCOL. THIS VERY IMPORTANT - COMRADE - FOR IF LE TRY TO  SEARCH HISTORY AND FIND PATTERN OF SHIPMENTS ONCE/IF A LEAD BEGINS; PACKS FROM US WILL NOT AND DO NOT EXIST IN THE ID DB. THEREFORE CRIPPLING LE ABILITY TO BOLSTER CASE OR GARNER SEARCH WAR.\r\n\r\nINTEGRITY\r\nTRANSPARENCY\r\nCOMRADE CUSTOMER SERVICE - any previous buyer who work with us, know our tenants stay true - issue? we refund or reship, just contact us, if negative feedback left with no extension of communication prior, buyers who work with us before know how we operate and refund with no issue\r\n\r\nWe have the righ to refuse orders with comrades whom kustim not feel comfortable engaging with.\r\n\r\n=== IN THE DARK SPIDERWEBS SAFETY IS A MUST COMRADE KNOW THAT \"\"CONVENIENCE IS INVERSELY PROPORTIONATE TO SECURITY & SAFETY\"\" === TEAM KUSTIM UNDERSTAND HUMAN NATURE NATURAL TO BE SHORT SIGHTED; BUT SPEND THOSE EXTRA MINUTES/HOURS TO ESTABLISH SAFETY BASIC OPSEC PROTOCOL AND PRACTICE THAT VERY WELL MAY PREVENT WEEKS/MONTHS OR WORSE OF LOST FREEDOM IF - GOD/ALLAH/BUDDHA/SPAGHETTIMONSTER WHOEVER COMRADE BELIEVE IN, FORBID, COMRADE GET COMPROMISED.\r\n\r\n If new comrade desire to be higher chance of eligible of joining our VIP family and accept trade.\r\n1. gain a greater amount of successful orders before engaging with us. \r\n\r\n2. Setup PGP in your profile ( To learn this basic safety does not take more than 20 minutes of your time comrade) Take every precaution to be safe, comrade who do not setup PGP give impression of someone who does not put in effort to engage in this trade safely, this type of comrade, not many vendor have interest in deal with.\r\n=====================================================================\r\nWe hope and assume comrade on Tails OS usb live boot, or Debian - morphed to kicksecure -> whonix Virtualbox-  need to create new pgp key pair, comrade ensure that you choose RSA key material for your key pair.\r\n\r\ncomrade open kleopatra\r\nclick FILE\r\nchoose NEW KEY PAIR\r\nselec CREATE A PERSONAL OPENPGP KEY PAIR\r\nfor details - these are optional, but for reference to comrade is speaking to for encryption use name as something same to username on asap. comrade not suggest to use or liist any email. !!!!!WAIT BEFORE you click NEXT on detail page\r\nCLICK ON ADVANCED SETTINGS\r\nleave everything AS IS - ensure RSA circlechoice is chosen inaddition to checkbox checked for  + RSA [AND if you read market faq, change bit security to 4096] (reason for this that existing pgp keys cannot be upgrade to 4096bit security, 3072 projected to be possibly breachable in a decade or less team kustim will create new public pgp soon with 4096 bit security and will make update with signed message of previous public pgp to ensure team kustim has not bee compromised - just upgrade to higher bit sec.)\r\nnow you will have a workable pgpable to add to market. danke comrade.\r\n=========================================================================================================\r\n3. Deal in XMR as BTC is a trustless currency. With btc address, outside party can gain info of all transaction input and output that have gone through BTC address; not good. XMR maybe comrade jump through extra hoop to get, but this worth. Comrade ever heard of saying \"follow the money,\" take a second of comrade time to find the amount of informatioin available just from btc address - every transaction received and sent....... MOVE TO XMR team kustim current high suggest exchange aggregate --TROCADOR-- for sweat free exchange btc to XMR, has onion and i2p, no javascript, privacy based, data delete after 14 days, refund guarantee amazing service, search on duck go, , compare all exchange, grades them, only usee grade A exchange, grade a never ask for kyc, grade B sometime ask for kyc and refund if not, do not be attract by low % exchange rate, avoid FIXEDFLOAT at all costs, they have seized held fund and demand kyc, not good. with btc fee higher than ever - delay and all - all more reason for community to switch to xmr and never look back. BTC had it's time - now is time for XMR age, just wait comrade.\r\n\r\n4. SMALL ORDERS: Try to understand from vendor perspective, that now with feedback underr belt. team kustim may defer order of low total. This not due to greed, it is that buyer must think that every pack is unarguable to be a risk even with every possible opsec security taken, this is inevitable reality, no?. and now that reputation and feedback may speak for self. no great reason to dip feet into pool of risk for 16 or 20 usd. Have faith in team kustim, our reputation and feedback speak for itself. Hence, sample stock and orders have ended. team kustim appreciate all comrade great who have taken time to leave team kustim feeedback. we bow to you and are honored.\r\n\r\n5. Do not ask for tracking. We will only release tracking to support or admin request. comrade better to be patient, and faith we will deliver, may ask status, comrade know that with tracking number, a multitude of malicious or opsec compromising things can be done.\r\n\r\n6. Do not have username that has anything tied to sensitive details. like name region etc. comrade not understand why comrade would do this. You must keep your identity unavailable by any means besides shared through PGP encryptoin. At end of day, dark spiderweb not joke - in eye of the state - we are criminal engaging in felony crime, not say -team kustim support war on drug, just fact of reality we live in.\r\n7. Do not use mobile device to connect to or engage in tor/market activities - do not do this - do not.\r\n\r\n\r\nA couple of footnotes small summary of minimal security for comrade safety. we care for comrade. we really do.\r\n=====================================================================================\r\n-comrade suggest tails, at very least, some form of debian distro linux mintt - debian morph to kicksecure virtual box -> whonix. but comrrade highly suggest tails with persistent storage if comrade not consistent with or know basic harden of linux.\r\n-usage of tor - isp can see comrade is connect to tor - but not able to see what comrade is visit \r\n- know what a CD is - never accept physical handoff of package if expecting soemthing from spiderweb from anyone try to hand to you - can pretend to be neighbor - pretend to be mailman \r\n-for extra safety for big packs - comrade suggeest when pack is deliver - bring inside drop - write RTS on it - leave untouched for period of time - if no knock; enjoy.\r\n- plausible deniabiliitytyi is comrade greatest defense - learn about it and to your advantage - if anything ever happen - remain silent  - speak no words but - I want to request a lawyer - if your rights are being read to you - know that \"it\" is happening, and do not believe LE - they can lie and manipulate truth to get words out of comrade - mouth shut lawyer up.\r\n-vpn's are wothless, do not think comrade is safe, only grant limited \"privacy\" which is not to be confused with anonymity.\r\n-do not speak of your dark spiderweb activy whatsoever, do not brag about where got items, do not ever text, email, anything relate to clearnet with spiderweb mix is asking for danger - whonix have great documentation on how phone are literal spy - comrade can search privacy phone - google pixel - grapheneOS open source free to install - very good - silent link anon sim - orbot - stay safe. snapchat - telegram - any and every messenger is unsafe and we will never deal with and comrade should never engage in illicit activity through messenger  - also tiktok app have literal keyloger on phone. learn about how privacy is almost reduce to zil as of recent.\r\n-if comrade deal in btc avoid KYC exchange like bubonic plague comrade. and if comrade lazy and do use kyc, never withdraw kyc btc straight from kyc to market wallet. at very least, comrade, withdraw btc kyc to electrum wallet, then go from electrum wallet to market wallet. This why comrade suggest XMR, as btc is now traceable and able to link and connect to transaaction. as of now, xmr best option for privacy as its blockchain not able to crack as of now.\r\n\r\n-duckduckgo search up drug test reagent kit, very cheap, and fentanyl strip test, very cheap, always test product. we despise and loath those who have bled and allowed fent to enter this world. terrible. to jeoparodize another life for monoetary gain; this is disgust. middle finger to those.\r\nsuggested basic reagent for wide variety of test confirm \r\n- simon a & b\r\n-marquis\r\n-merke\r\n-zimmerman\r\n\r\nbe aware - if comrade play with opiate presses or charliehorse - we plead comrade to buy fent strip test - unfortunate reality that majority of opiate press and charliehorse has fent or fent analog cut. your life is meaningful and worth it\r\n\r\n-it is not suggest to consume GRAPEFRUIT with benzo as this is contraindcation since GRAPEFRUIT affect cytokine receptor in which benzo anxiolytic affects interact and influence upon and can heavily potentiate its efffects for those who are not high tolerance.\r\n\r\n-care for homeopathic otc supplements and usage of antiddepressants SSRI AND MAOI's with stimulants and adderall, and do not mix OTC supp St john wort with these or mdma/molly/xtc as this will send comrade to critical state known as serotonin syndrome.\r\n\r\n-Comrade must aware that benzo withdrawal is one of few substance comrade can die from withdrawls. yes. as uncomfortable as heroine and meth withdrawal may be, comrade cannot die from meth/heroine withdrawal, but benzo, comrade can. If comrade become deep into benzo addiction, consumption of more than 8-12 milligrams a day, or 2-4 bars a day consistently for a period of time longer than a month. You are enter danger zone comrade. DO NOT ABRUPTBLY STOP OR COLD TURKY YOU NEED TO PREPLAN IF YOU ARE DEEP IN BENZO ADDICTION OR COMRADE CAN DIE FROM BENZO WITHDRAWAL AND WE DO CARE ABOUT YOU. \r\n\r\nA BEGINNER GUIDE ON HOW TO TAPER BENZOS:  is to halve your usage each week if you can, or every two week. example: if comrade consume 8 milligram a day everyday a weeek. and supply running low, taper slowly to what comrade can handle, following week taper each day to 6mg ideally 4 mg a day and so on halving each day dose every following week (idealy) if not, then 2 week. \r\n\r\nExample: \r\nweek 1 each day dose iis 8  mg everyday\r\nweek 2, taper to 4mg everyday\r\nweek 3 taper to 2mg everyday\r\nweek 4 atper to 1mg everyday\r\nweek 5 taper to 0.5 every other day\r\nweek 6 comrade is likely safe from critical benzo withdrawal , but know that anxiousness, hypersensitivity to stimulation may remain to a degree for months. stay strong. and comrade must try to not steep into tarpit of benzo abuse this deep again. moderation, and self control is must comrade.\r\n\r\n\r\nTake care of yourself comrade. there is a role and plan that comrade must fulfill in this world, and by not working towards that role or goal, comrade actively depriving world of this necessity. let us all flourish as we are all in this together.\r\n==========================================================================================================\r\n\r\nCURRENTLY THE DNETMARKETS ARE A PERFECT EXAMPLE OF GRESHAMS LAW and The race to the bottom teory...\r\nHow Vendors continuially seek to lower their prices or increase their margins through the practicce of lacing products with addulterants such as fent or meth, and in order for other vendors to compete to the buyers eye, the average vendor must take the same route to survive in this market.\r\n\r\nAnd buyers continually seek for products that are at a lower cost, and reject items that are of better quality but tied to a higher fee due to its quality components.\r\n\r\nHelp us create  and support the demand for high quality products, stop supporting dirt cheap items such as pressed addys that come to a dollar a piece made almost entirely of methamphetamine and cut with caffiene with no amph yet claimed to be within it.\r\n\r\nHELP US CREATE A MARKET LET US SHIFT THE PARADIGM\r\n\r\nFEEDBACK LEFT AFTER ORDERS WILL GRANT YOU VIP TREATMENT FOR EVERY ORDER THEREAFTER\r\nCOMRADE THIS INCLUDES TAKING PRECEDENCE ON BATCH CYCLE ORDER, EXTRAS, HOOKUPS, AND MORE COMRADE MAY REQUEST OFFERS. WE CHERISH OUR COMRADES.\r\n\r\nAFTER LEAVING FEEDBACK MESSAGE US WITHINT HE ORDER AND WE WILL GIVE YOU A GRACIOUS COUPON\r\n\r\nPlease finalize as soon as possible after receiving the order, and please comrade take just a second to write any feedback, we will be heavily inclined to show favor in extras and line in batch cycle drops as well as issuing coupons to those who leave feedback.\r\n\r\nPlease contact us before leaving a negative review, we always go an extra mile to make things right, those who leave shady feedback without touching base with us first raises red flags as a shill account, especially accounts with no orders until ours. Were you disappointed by something? talk to us, please.\r\n\r\nNEW COMRADE? MESSAGE US FOR COUPON\r\n\r\nOur tentants and business model revolve around integrity, Opsec, and your safety. Rubles, Rupees,  USDs, and payments in the form of trident layers come second.\r\n\r\ndark time may come - but dark time is transient period - although in the midst of it - hell may never seem to end - but stay strong and it is often in retrospect we look at the most difficult times in our life with a sense of beauty and admiration of growth - please if ever struggle with suicide - call suicide hotline and seek help; there is no shame in seeking for help or therapy, no, this is courage - you are worth it comrade - please.\r\n\r\nAlthough team kustim have comrade; in no way shape or form do we support current/past russian regime, putin, current/past events of mother russia. This why comrades have left, in search for better life, opportunity, all human have right for this pursuit; the pursuit of happiness, America is home. After soviet regime political regime collapse, but its economic structure did not and heavily remains and team kustim see no change - economy is corrupt oligarchy - unbelievable split from extreme select few groups/people of extreme wealth - then public population hideously poor opportunity and even job within russia considered great for commoner is work very hard yet still most still have trouble affording necessity like medication and health services - quite literally no middle class nor great way to rise. Opportunity is poor in mother russia; before great conflict with america that chokehold visa to america; eligibility through lottery gave chance for comrade in team kustim; leave childhood friends, family for chance at life, for pursuit of happiness in great Americas.\r\n>This why we mock putin in profile picture, pornstar no problem with occupation, respectable - it is job - must pay bill and way of living that not incur harm to others. putin no respect; bad man, sociopath. Team kustim wish for safety and independenc of Ukraine and wish there was no conflict - why human life have to put in danger in these times - why war? War not the way - diplomacy through non-violence - diplomacy through non violent means. The great Gulag Archipeligo, single handedly dismantled the illusion of communist ideology and treatment in russia. The pen is truly mightier than the sword. Danke for comrade Aleksandr Solzhenitsyn, for your horrors comrade witness and documented in literature that will survive time. Saved lives - altered the ultra horrors of russian life for commoners.\r\n\r\nloose intepretation of quote of winston churchill, who had bipolar disorder - \"when you find yourself in hell, strap that fucking belt on and march through\"", "policy": "FIRST REFUND RESHIP 100%", "is_trusted": false, "is_verified": true, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/lil_psychedelic_boomshankar_shop", "tagline": "turn on tune in and drop out! always legit!", "details": "READ THIS PLEASE!! \r\n\r\nATTENTION! very important ,  i ALWAYS  ship, but im not flash, im not amazon, i do it all with the flow!   i repeat!  my parcels can arrive from 2 to 8 weeks if are from mexico with track!!  from uk, can  be 3 to 15 days inside uk, 2 to 8 weeks  internationally !  From usa, i only have certain items and only domestic, eta is 3-15 days and from india the same, domestic eta 3-15 days international eta 2-8 weeks  pleaaaase dont affect me with a bad ranking if you dont have it in 2-3 weeks!!!  i  BEG  you your patience!!\r\n\r\nhi!  my team is my kitty, my wife, my chemist brother  my shipping team in usa , uk and india  and  me. we r here to serve u!\r\n\r\nonly psychedelics.\r\n psychedelics dont heal u, they show u how to heal yourselves!\r\n\r\nim a established vendor, you can verify me  on  darknet trust, dread, recon, kilos. i got your back! i have been on the loop since 2016, in all the big markets that has disappear, im honored to say that on all those  i have had great rankings. \r\n\r\nplease provide the address exactly as it should go on the envelope\r\n\r\nname\r\nstreet, house/dept #\r\nzip code\r\ncity\r\ncountry\r\n\r\nIf your pack doesn't arrive ill give u 50 % reshipment  or 50% refund(after 2 months waiting, that never happens), give it a try u will be very very happy! to older customers in special dates i give freebies. :D\r\n\r\ni have shipping team in uk, usa and mexico, not all products are available on those 3.  i stock up each location as fast as possible.\r\n\r\nin the UK shipped products, i dont offer track, but as is royal mail, tend to be quicker and equally safe.\r\n\r\nUSA shipments have track, is only domestic.\r\n\r\nmex shipping has track, and is WW.\r\n\r\n   INTERNATIONAL SHIPPING  DOES TAKE ITS TIME(2-8 weeks random af), BUT IT ARRIVES, IF U FEEL RESTLESS CONTACT ME, IM ALWAYS AVAILABLE, DONT MAKE ISSUES BEFORE WE HAVE A CHAT!!!\r\n\r\nFam, im a human like u, im not a big company with a lot of slaves working at a drum speed, sometimes i ship it the same day i receive the work order, sometimes i get delays(low stock so i work like an ant, or visit my family, or a roadtrip weekend) so please please..  grant me your blessed patient if i take a few days to ship, i always do it! lots of love\r\n\r\n\r\nWHEN U PURCHASE FROM ME, WE BECOME A TEAM, U R NOT ALONE IN THIS, I GOT YOUR BACK FOR ANY ISSUE, JUST HIT ME UP. \r\n\r\n\r\nif i take  a few days to ship, i really apologize, sometimes life gets in the way, but i ship for sure!\r\n\r\n\r\nBTW.. WHERE IS THE LOVELY TRADITION OF USING PGP??? LETS KEEP THE NETWORK SAFE FAM! MUACKS MUCH LOVE", "policy": "read carefully please!\r\n\r\nin the title say from which place the product can be shipped. some products  are only shipped inside usa, some only from mex to the world, some from uk to the world and some from india to the world, attention there!\r\n\r\nas we cant wait forever, after the ETA, we can think the parcel got lost or seized ( this happens 1-2 parcels out of 100, so its  low risk) so we can work  50% refund or 50% reship (unless your address was wrong, there is no name, or some weird situation)\r\n\r\n ALL INTERNATIONAL ETA :  2-8 weeks\r\nALL DOMESTIC ETA :        3-15 days\r\n\r\ni know that seem too much, but thats what i have experienced for years. very random tho!\r\n\r\nUK PARCELS DOESNT HAVE TRACK!\r\n\r\nthanks a ton!  i love u so much my lovely customers!", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["GB", "IN", "MX", "US"], "ships_to": ["AG", "AS", "AU", "BD", "BE", "BR", "BZ", "CA", "CH", "CL", "CN", "CR", "CY", "CZ", "DE", "DK", "DM", "DO", "EG", "ES", "FI", "FR", "GB", "GH", "GR", "HK", "HR", "HU", "ID", "IE", "IL", "IN", "IT", "JP", "KE", "KR", "LB", "LK", "LR", "LU", "LY", "MA", "MC", "ME", "MN", "MX", "MY", "NL", "NP", "NZ", "PH", "PL", "PR", "PT", "RO", "SE", "SG", "TF", "TH", "US", "ZA"], "avatar": "/uploads/avatar_0Jyo9dv.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Lizario", "tagline": "", "details": "Primarily THC vendor. \r\nFeel Free to DM me with ANY questions or concerns!\r\n\r\nOrders ship out 6 days a week. Deliveries average 3 days or less. Tracking numbers given out after 3 days upon request or earlier at my discretion. Order as much or as little as you wish! Customer service is something I focus on, Loyal customers get freebies/gifts often! I also ask that you stay on top of Finalizing your orders and writing at least one review, these are crucial to my business and it helps me out a ton.", "policy": "Case by case basis, You will be taken care of!", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_YPOAHPb.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Lord_Onyx", "tagline": "All you need, (all you really need), is good Love.", "details": "This is the famous White Fluff, aka The family Fluff, or Paperwork.\r\nSometimes the artwork changes, but its all the same. This paper is laid with love, 100-110 mcg per dose.\r\nWe are fast, sometimes same day service, never more than 3 days.\r\n\r\n50   doses    125.00\r\n100  doses    190.00\r\n500  doses    900.00\r\n1000 doses   1500.00", "policy": "1. USPS flat rate envelopes, 2-4 days, US-US.\r\n2. Never have problems mailing paper, But if something happens, will refund half of original order, or reship 70% to new address.\r\n3. If we are out of a product, message us because it wont be long until we restock", "is_trusted": false, "is_verified": false, "num_reviews": 5, "num_stars": 4.6, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_YhRhlsd.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/MalwareSampler", "tagline": "We have it all!", "details": "Hey there, I am a sole vendor, I sell whatever high quality items I have on hand for reasonable prices! Be it malware, drugs, fake gold, etc.\r\n\r\nFeel free to contact me whenever!\r\n\r\n(Personal shop coming soon.)", "policy": "For physical items:\r\nCustoms in New Zealand are strict and it is often difficult to get things through, part of the reality of buying illegal items in New Zealand is shit disappears. \r\n-\r\nIf something doesn’t make it to you, I will offer a single refund, however I will not sell to you again unless you are a longtime buyer (prevents theft)\r\nFirst time buyers may only make small orders.\r\n\r\n\r\nFor digital items:\r\nDigital products are not ALL guaranteed to be safe, especially those such as \"collections of x\" as they’re simply collections being resold. However, custom made malware’s, digital media (Ie music) etc is absolutely guaranteed to match what is purchased!", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["NZ"], "ships_to": ["NZ"], "avatar": "/uploads/avatar_VriBYrK.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/MARSHALL_SHOP", "tagline": "TOP10 BENZOS VENDOR on the DARKNET ;)", "details": "*******MARSHAL STARTS WITH NEW SERVICE and brands from November 2022*********************\r\nBecause lot of troubles with regular shipping in the past - MARSHALL starts with TRACKING SHIPPING option now!\r\nAlso, we got new brands on the stock now!\r\nBe free to order now!\r\n**********************************************************************************************************\r\n\r\n\r\n\r\nMARSHALL is a trustable vendor with ove thousand successful transactions at other markets. You can check our reputation at the RECON profile MARSHALL :\r\nhttp://recon222tttn4ob7ujdhbn3s4gjre7netvzybuvbq2bcqwltkiqinhad.com/vendor/0x82ED266863E70A77\r\n\r\n\r\nWe have all legit pharma ORIGINAL products.\r\n\r\nWhen you buy over 100 blisters - let me know the number of your orders to prove you're telling the truth - and you'll get a blister bonus the next time you order.", "policy": "", "is_trusted": false, "is_verified": true, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["DE"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_LDhI6d8.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/MerrianWebster", "tagline": "UK Grown quality Weed", "details": "I'm a small-scale UK Cannabis grower.\r\nI grow all the Cannabis I sell, there is no middleman involved.\r\n\r\nI will only deliver to addresses in the UK.\r\nDispatched from the UK.\r\n\r\n3.5g are sent first class and should fit through your letterbox.\r\n2ml RSO is also sent first class, and should fit through your letterbox (depends how thin your aperture is, however its only 2 centimeters thicker than the 3.5/5g packages).\r\n\r\n14g and up are sent special delivery. A signature is required, and will not fit through a letterbox. \r\n\r\nMy Recon profile can be found here - http://recon222tttn4ob7ujdhbn3s4gjre7netvzybuvbq2bcqwltkiqinhad.onion/vendor/0xCAA3453925009433", "policy": "Each weight has its own designated delivery fee. Please make sure you select the correct delivery for the product weight.\r\n\r\n\r\n\r\nOrders confirmed before 1pm UK time, are sent the same day.\r\n\r\n\r\n\r\nOrders Saturday and Sunday, will receive delivery Tuesday.\r\n\r\n\r\n\r\nAddress needs to complete, i.e\r\n\r\n\r\n\r\nFirst Name Last Name\r\n\r\nAddress Line 1\r\n\r\nAddress Line 2\r\n\r\nTown\r\n\r\nCounty\r\n\r\nPostcode\r\n\r\n\r\n\r\nIf there is no name, or if there is a blatant Mikey Mouse-type name , then I can not post it.\r\n\r\n\r\n\r\nRefund Policy only for Special Delivery orders -\r\n\r\n50% refund or reship if you have five or more orders with me.\r\n\r\nAll reships will require a new address, this is in case your address has become hot.\r\n\r\n\r\n\r\nThere is no refund for First Class deliveries.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["GB"], "ships_to": ["GB"], "avatar": "/uploads/avatar_nvOgpmp.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/mrmaster55", "tagline": "mrmaster55 drugs", "details": "Hello dear customers, welcome to my shop!!\r\n\r\nFor those who dont know me as a vendor, I am an experienced and established vendor with around 1500 sales.\r\n\r\nI focus a lot in satisfying my clients! I can offer you a TOP QUALITY PRODUCT at TOP PRICE!!!\r\n\r\nI provide the best customer service, feel free to ask any question you have.\r\n\r\n\r\nI accept and ship orders every single day, from Monday to Sunday!!\r\n\r\n\r\n\r\nPRODUCTS SECTION\r\n-------------------------------------------\r\nI ONLY SELL PURE AND HIGH QUALITY PRODUCTS!\r\n\r\n\r\nI offer XTC pills made of the purest and finest MDMA. They are strong and hard pressed!\r\n\r\n\r\n94% Pure Columbian Cocaine - In stock\r\nSpanish Weed - many different strains - in stock\r\nGold morrocan hash - in stock\r\n\r\n\r\n\r\nSpeed - Out of stock\r\nMDMA - Out of stock\r\nHeroin - Out of stock\r\n\r\n\r\n\r\nI am looking forward to offer more products in the near future!!\r\n\r\n\r\n\r\nSHIPPING INFORMATION:\r\n-------------------------------------------\r\nI ship only to countries within Europe, with some exceptions, private messages me for more information.\r\n\r\nEstimated delivery time is from 3 to 14 business days.\r\n\r\n\r\nADDRESS\r\n-------------------------------------------\r\n- Please provide us the following data when placing an order ->\r\n\r\n- FULL NAME\r\n- STREET + HOUSE NUMBER\r\n- CITY POSTAL CODE\r\n- COUNTRY\r\n\r\n\r\nRESHIP/REFUND POLICY:\r\n-------------------------------------------\r\nIn case of non-arrival because customs intercepted, I can offer you 50% refund.\r\nGet in touch with me and I will resolve it!", "policy": "In case of non arrival, because customs intercepted the package, 50% refund. \r\n\r\nOtherwise if the fault is yours, for example wrong address or you haven't received the order because you wasn't at the provided address, that's not my fault - 0% refund/reship", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["ES"], "ships_to": ["AD", "AT", "BE", "BG", "CH", "CY", "CZ", "DE", "DK", "ES", "FR", "GR", "HU", "IE", "IT", "LU", "NL", "PL", "PT", "SI", "SK"], "avatar": "/uploads/avatar_xJWyAO7.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/MrMischief", "tagline": "Darkweb Pro League", "details": "Welcome to our Drugula store!\r\n\r\nShipping daily US-US\r\n\r\nOur Operation maintains a small team and treats this business with care. Your order is important to us and customer safety is important to us. We have long been buyers on the market and sell here on T2D to provide an excellent service that people can find dependable and consistent.\r\n\r\nWe have been in the shipping business and active on the markets since long long time ago. Now here on T2D to offer our MDMA and XTC that customers love. Darkweb Pro League we are new to this market but not new to this business. We will always deliver for you and have a 100% success rate. Any issues we will always work with you. We are reasonable people and want to work to ensure your safety and delivery of your product.\r\n\r\nNo Scams Allowed in Our Store\r\n\r\n\r\nWe are not here to compete with every vendor on price. We provide top quality and service all around. Communication day and night, product quality, shipping speed, and packaging stealth are all top rated on every order in our shop. Attention to detail is top level and we do not cut corners. every customer gets the same equal treatment from us. Youll find our service to be one of the best and most consistent anywhere on the web. Order now with us and try us out, you won't be disappointed!\r\n\r\nProducts:\r\nLSD 100ug blotters\r\nCannabis AAA Indoor $150/oz\r\nCannabis Exotics - CBX 3.5g 1/8oz Jars\r\nBulk flowers available, multiple strains available, mix and match QPs available\r\nCartridges, bulk available\r\nDisposables, bulk available\r\nConcentrates - THC Sugar Diamonds, THC Crumble\r\nEdible Gummies 200mg Packs\r\n\r\nWe are excited to offer you all of our excellent products. We aim for the best possible quality on everything we touch and to provide best service possible to every one of our customers. We treat this business with love and care and pay attention to the detail.\r\nWe all want to welcome you to come shop here in our store, we are here to be of service for you in every way possible. Please message me if you have any questions. Stay safe and consume responsibly", "policy": "All orders are guaranteed for delivery! We have 100% success rate and have been operating for long time in the shipping business. Every package is handled with care and stealth is top grade. We will insure that your package delivers to you. If any issues arise then contact us to find a solution.\r\n\r\nWe guarantee you will receive your order or full reship. Please double check delivery address and use proper address format. We cannot guarantee delivery if there are address issues or fake names used on your package. Any other case will be handled on a case by case basis. We will always do everything we can to decide cases in favor of the buyer and get your package to you quickly and securely.\r\n\r\nIf package is delivered to a wrong address or returned to sender due to mistake made by the buyer, then we cannot offer refund or reship. Please do not use fake names on your package. Fake names cause possible error with delivery. Again we cannot reship or refund if issue is due to using fake name or incorrect address.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/neverland-IDs", "tagline": "One stop shop for all your Fake ID needs!", "details": "# Neverland IDs!\r\n\r\nA one stop shop for all US Fake Ids!\r\n\r\nI do all states right now except for Hawaii and Alaska! (but if demand is high enough that could change)\r\n\r\n## Note\r\n\r\n**I am just getting this shop up and running!**\r\n\r\n**I will be putting a listing up for each individual state!**\r\n\r\n**If you don't see your state of choice yet, don't panic! Just purchase one that is listed and message me about it, we got you covered.**\r\n\r\n## Required Information\r\n\r\n* First name\r\n* Middle name (optional)\r\n* Last name\r\n* Street address\r\n* City\r\n* Zip code\r\n* ID date of birth\r\n* ID date issued\r\n* Eye color\r\n* Hair color\r\n* Height (feet)\r\n* Height (inches)\r\n* Weight (LBS)\r\n* Gender (M/F)\r\n* Corrective Lense? (yes/no) (most of the time this is no)\r\n* Organ Donor? (yes/no)\r\n* Picture (Solid colored wall (prefer white!) or blue backdrop, can be purchased cheaply on amazon or walmart. Take picture with flash if you can)\r\n* Signature\r\n\r\n\r\n**Please make sure you have all of these things! Makes both of our lives so much easier! I can send things out super fast if you give me all of this correctly the first time around!**\r\n\r\n## Note!\r\n\r\nThe picture is absolutely the most important part! You can make my life so much easier if you give me a good headshot! Otherwise I have to spend more time in Photoshop doing some bullshit. \r\n\r\n## Uploading Pictures\r\n\r\nYou can upload pictures with Dump.li!\r\n\r\nYou can find Dump.li from tor.taxi or the onion link below\r\n\r\nMake sure you set it to last for a while so I can see, I only check so often!\r\n\r\n* http://dumpliwoard5qsrrsroni7bdiishealhky4snigbzfmzcquwo3kml4id.onion/\r\n\r\nIf dump.li is an issue for you, you can check out mega.nz or anon files.\r\n\r\n## Shipping Guide\r\n\r\nMake sure to provide correct shipping address information!\r\n\r\n**PLEASE PLEASE PLEASE make sure you ENCRYPT THIS INFO!!**\r\n\r\nFirst last name\r\n123 street\r\nState, city, zip.\r\n\r\nShipping times varies up to 14-18 business days, often **much** sooner depending on what I am doing. I work a full time job so I am still a bit busy sometimes!", "policy": "# Shipping!\r\n\r\nMake sure to provide correct shipping address information!\r\n\r\nFirst last name\r\n123 street\r\nState, city, zip.\r\n\r\nShipping times varies up to 21 business days, Often much sooner", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_niWK8PH.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/NftScamz", "tagline": "All things nft related", "details": "Create scam tokens, fake nft mints, crypto drainers and more!", "policy": "I will deliver your products to the best of my abilities, however as they are digital I cannot offer refunds", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_M7urVWT.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/NoBullshit", "tagline": "Roses are Red,Violets are Blue,come visit my Shop,let Happiness come to you!!!!!", "details": "NoBullshit ist ein Qualitätsstandard,es ist unser Anspruch an unsere Produkte mit denen wir seit Jahren erfolgreich unsere Kundschaft beglücken. \r\nUnser Hauptgeschäft besteht aus dem alltäglichen Vertrieb außerhalb des Internets, wo wir seit Jahren sehr erfolgreich agieren und ein Millionenschweres Netzwerk aufgebaut haben.\r\nDurch verschiedene Sicherheitseinrichtungen in unserem Netzwerk war der einzig logische Folgeschritt für uns, dass Internet an unserer Kompetenz und und unserem Gütesiegel \"NoBullshit\"\r\nteilhaben zu lassen. Überzeugen Sie sich selbst von unserer diskreten,schnellen und zuverlässigen Arbeitsweise.\r\n Wenn Ihnen gefällt wie Wir arbeiten und unsere Produkte Sie überzeugen können,Bewerten Sie uns und lassen Sie einen Follow da!!!\r\n\r\nNoBullshit is a Qualitystandard, it is how we claim our Products to be , we are satisfying our Costumers with for years now.\r\nOur Mainbuisness is the daily distribution outside of the Internet, where we act very succesfully and could raise a Network worth millions.\r\nSince we secured our Network pretty well, the next logical Step for us was to share our competence and our seal of approval \"NoBullshit\" to the Internet.\r\nConvince yourself and try out our discreet,fast and reliable way of work.\r\nIf you like how we work and our Products convinced you, please evaluate us and leave a Follow!!!", "policy": "REFUND POLICY\r\n\r\nWithout tracking: If the fault is not with us, there is no reship.\r\nWith tracking: It depends on the case. 50-100% reship.\r\n\r\nIf your order does not arrive:\r\nRegular customers will of course get a reship! \r\n\r\nOhne Tracking:Liegt der Fehler nicht bei uns,gibt es keinen reship!\r\nMit Tracking: Abhängig vom Fall, 50-100% reship!\r\n\r\nKommt ihre Bestellung nicht an: STAMMKUNDEN bekommen natürlich eine erneute Sendung!", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["DE"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_iCSPMpI.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/NoRegrets", "tagline": "Once \"In\" no way out, you will ❤", "details": "We sell legal items or 'barely' legal items but something that fits in the deep web and not in the dark. \r\n✈ voyage in the deep dark is to Bright.", "policy": "50% is case of any Mishaps.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["LK"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_WQpjSkx.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/nroh73", "tagline": "French drugs seller", "details": "Hi everyone! I have just been delivered in stock of drugs in Marseille! Top quality delivered from Spain and Holland by a friend! \r\n\r\nPayment in the crypto' you want (If other than Monero, +20% of the price for mixing)", "policy": "Possible delivery by hand in Lyon north or collisimo / relay point delivery safely, packaging 100% hermetic and hidden in a device with false invoice! \r\n\r\nPrice of remote delivery: 10 € or free for 100 € minimum purchase.\r\n\r\nDelivery within 5 days guaranteed", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["FR"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EG", "EH", "ER", "ES", "FI", "FJ", "FK", "FM", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_FJ9h7Kj.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Pandapy3_Apathecary_and_Emporium", "tagline": "Panda Proffesors that provide the best of the best.", "details": "Welcome to “Professor Panda’s Apothecary and Emporium”! We take immense pride in our team of Panda Professors who are not only knowledgeable and helpful in guiding you through your psychedelic journey with a group of passionate advocates for and of Sexual Psychology and use of Phenethylamines for marital aid, repair, or discovery.We offer overnight detox medication and regiments. \r\n\r\nOur Panda Professors are well-versed in the complexities of addiction and the potential role that psychedelics can play in addiction recovery. We offer a compassionate and understanding approach, providing valuable insights and resources to those seeking assistance. Whether you’re looking for information on harm reduction strategies, exploring the potential therapeutic benefits of psychedelics, or seeking guidance for yourself or a loved one or both, struggling or just wantin to expand their minds, our Panda Professors are here to listen, educate, and offer support and point you in the direction of a product thats just right for you!\r\n\r\nAt Professor Panda’s, we believe in the power of education and destigmatizing addiction. Our Panda Professors actively engage in addiction advocacy efforts, raising awareness about the potential benefits of psychedelic-assisted therapies and the importance of evidence-based practices. Through our platform, we provide a safe and inclusive space where individuals can find information, resources, and a wide vireity of products.\r\n\r\nbe a part of the best and only PhD.Panda'S Apothecary and Emporium” and experience not only a wide range of top-quality psychedelic products but also the compassionate guidance of our Panda Professors, who are dedicated to addiction advocacy and helping individuals on their path to healing and transformation. Enjoy your \"trip\" to the Panda Apothocary and Emporioum, We have something for everyone! \r\n\r\n- off menu items are availabe contact us via private message and ask we just might have what your looking for", "policy": "IF YOU NEED OVER THE NIGHT DETOX MEDS I WILL SHIIP THEM TO YOU STEALTH AND A TRUE OVER NIGHT I WILL ALSO SUPPLY A REGIMENT TO FOLLOW IF YOU WANT OT KICK OPIETS I HVE TO THIS DAY HELPED 12 people k ick opiets by gaining a true understanding of what your  facing and a firm but soft guideing hand th enier way. If it is bad enough I will even consider 府谔谔热毒草剃哦那三 IF YOU ARE EVER IN WITHDRAWL I AM YOUR PANDA I WILL RESHIP 100 IF \r\n\r\nost your address with real name \r\nNO PO BOXES\r\n\r\n␣␣␣␣Recipient's name\r\n␣␣␣␣Street number and name\r\n␣␣␣␣City name\r\n␣␣␣␣Postcode\r\n␣␣␣␣Country\r\n\r\n\r\nif seized 50% -100% reship refund. we will talk case by case basis also depends on mannors, MANNORS are a MUST. Depending on situation we may do 100% reship but you must come to us, we are quite the understanding bunch.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["AD", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SZ", "TD", "TF", "VA", "VC", "WS", "YT", "ZA"], "avatar": "/uploads/avatar_wbn1E5r.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/ramdaram", "tagline": "Fake money store", "details": "Not flawless but pretty good, best to pass at night.\r\n\r\n- Watermark (printed on back)\r\n- Color changing ink green/blue\r\n- Good color\r\n- Notes feel softer than the real\r\n\r\ndoes not work in machine\r\ndoes not have the uv ink\r\ndoes not have metal strip\r\nSometimes I will throw in extras\r\n\r\nNO tracking.\r\nNO samples.\r\n\r\nWe copy the given address to our label so please make sure your shipping information is included in the following format:\r\n\r\nName + Surname\r\nAddress (Street name + number)\r\nPostal/Zip code + City\r\nCountry\r\n\r\nPlease remember to write it in this order, wrongly written addresses are not our fault!\r\n\r\n\r\n\r\n3X50 for 16\r\n5X50 for 25\r\n10X50 for 49\r\n\r\nLimited stock we are not here forever.", "policy": "Refund 100% for seized orders(extremely rare).\r\n\r\nRefund 0% for quality complaints we are very clear about the quality they are not flawless.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["EH"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_mnHQLJW.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Realchemsupplier", "tagline": "Thanks for visiting our store. We are direct manufacturers and suppliers of Research Chemicals and Pharmaceutical Intermediates. We strive to offer the best service possible we will send your packages", "details": "Thanks for visiting our store. We are direct manufacturers and suppliers of Research Chemicals and Pharmaceutical Intermediates. We strive to offer the best service possible we will send your packages fast and with great stealth.\r\n\r\n\r\nWe have our own lab to make sure our products are under quality control, and large orders are available. All our products are TOP quality (purity above 99%). please do not hesitate to contact us if you need any product that is not listed in our product list, we can produce. We are here for long term business, so we only offer high quality products at fair prices and discount on bulk orders.", "policy": "----------------------------------RESHIP AND REFUND-----------------------------------\r\nWe do 60% if package is missing or seized by customs reship or 50% refund in BTC. Please make sure you ENCRYPT, Also, no reship for any kind of shipping info sent unencrypted, or incomplete addresses ! and use the correct shipping format because if your package does not arrive and the format you gave was incorrect you will not be entitled to claim a new shipment or refund.\r\n\r\nPlease state your shipping information in the following order:\r\n\r\nName: ...\r\nAddress (street-name + number): ...\r\nPostal/Zip code and City: ...\r\nCountry: ...\r\n\r\nNever send me any kind of links for your address (e.g. private note), I won't click on them !\r\n\r\nI do only tracked shipping and I provide tracking number only when order has issues landing.\r\n\r\nNever ever threaten (or even bring up) giving me a negative feedback in case of a missing order. This feels as extremely disrespectful since I do my upmost best to provide you with the best service as possible.\r\n\r\n\r\n--------------Shipments will only be dispatched on the following days--------------\r\n*Monday\r\n* Tuesday\r\n* Wednesday\r\n* Thursday\r\n* Friday\r\n\r\n_______________VERY IMPORTANT INFORMATION_______________\r\nPlease kindly confirm product quality and quantity within 24hrs after receipt or finalized. We will not be responsible for product quality or quantity complains after such time. In a rare case of non arrival please contact us before starting any kind of dispute or even negative feedback. Every problem has its solution and together we will get out of it. We are not out to scam anyone So don't try to scam us.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["HK", "NL", "US"], "ships_to": ["AD", "AE", "AG", "AI", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_0zR1AAz.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/RossDrugs", "tagline": "Turkish Vendor", "details": "I'm Turkish vendor. I do not have ethical things.", "policy": "Products are ship in 2 business day.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["DE"], "ships_to": ["AD", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TN", "TO", "TR", "TT", "TW", "TZ", "VA", "VC", "WS", "YT", "ZA"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/SexyPenguin", "tagline": "Contrary to popular belief, I do not sell sexy penguins.", "details": "Hello fellow penguins,\r\nHere I sell xanax.\r\n\r\nChemicals I use for xanax: Flualprazolam (Blue), Alprazolam (White), and Bromazepam (Yellow)\r\n\r\nIf you need anything custom, feel free to reach out.", "policy": "I will reship the order if it gets seized.\r\nIf it says marked, I will not refund or reship.\r\nIf there's a problem on my part, you will be compensated.", "is_trusted": false, "is_verified": false, "num_reviews": 20, "num_stars": 5, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_fP0EpLZ.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/ShellUK", "tagline": "Honest, Fast and Reliable Service! :)", "details": "In Stock: MDMA\r\n\r\n★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\r\n\r\nThank you for working with ShellUK! Your customs is appreciated and we hope to reflect that in our customer service. You can find our feedback both here and on Recon - customer satisfaction is paramount to us. We will look after you! :)\r\n\r\n★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\r\n\r\nNote: Our public Key has been updated to the the ShellUK Master Key. We can verify ownership of all keys for your peace of mind.\r\n\r\nNext Day Cut-Off: 3pm (Monday - Friday).\r\n\r\n- Every message will be replied to within 24 hours.\r\n\r\n- All listings are escrow for your benefit.\r\n\r\n- All orders are sent out with Top Tier Stealth and methods to bypass customs Worldwide.\r\n\r\nMost orders will arrive next day with our Free RM 1st Class shipping option unless you live in Scotland etc or if you are ordering International.\r\n\r\nWe offer very competitive prices. And no, we do not aspire to pebble bulls**t products made with Chinese analogues or under-dosed infusions.\r\n\r\n- Professional Stealth\r\n\r\n- X-Ray & Sniffer Dog Proof\r\n\r\n- UK NDD\r\n\r\n- International Track & Trace\r\n\r\n★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\r\n\r\n1) Why should I trust you?\r\n\r\nYou shouldnt! You can make a pretty well informed decision from looking at our vendor reviews on Recon as we recommend you do so with all vendors.\r\n\r\n2) What markets have you been active on?\r\n\r\nThis can be verified on Recon but we have been active on:\r\n\r\nWHM, Cannazon, ToRReZ, Dark0de and ASAP.\r\n\r\n★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\r\n\r\nPlease provide your address as follows when ordering:\r\n\r\nDavid Smith (Name)\r\n55 Bakers Road (House and Road Name)\r\nMaidstone (City)\r\nKent (County)\r\nSH55 7GF (Postcode)\r\nUnited Kingdom (Country)\r\n\r\nPlease make sure to use your real name when writing your address. The Post Man delivers your mail every day - it is a lot more suspicious if you put a fake name.\r\n\r\n★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\r\n\r\nUnited Kingdom: Next Day (3pm cut-off) \r\nEurope: 3-5 Days \r\nWW: 3-28 Days\r\n\r\nDomestic Refund Policy: Full reship or refund if order is not received after 7 days - will be dealt with on a person by person basis. \r\n\r\nInternational Refund Policy: 50% reship or 50% refund if order is not received after 28 days.\r\n\r\nPlease note that seizures are rare when sending domestically (UK) - Royal Mail must have a warrant to open packages if it is deemed that controlled substances are contained.\r\n\r\n★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★\r\n\r\nFree Ross Ulbrich and RIP Alexandre Cazes.\r\n\r\n★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★", "policy": "Domestic: 100% refund or reship if order is seized or lost.\r\n\r\nInternational: 50% refund or reship if order is proven seized or lost.\r\n\r\nPolicy: If you leave a negative review we will be less inclined to help you. Please message us first.", "is_trusted": false, "is_verified": true, "num_reviews": 0, "num_stars": null, "disputes": {"num": 1, "won_percent": 0, "lost_percent": 100}, "ships_from": ["GB"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_xOSHyiS.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/sigmachems", "tagline": "Legit Suppliers of Cannabinoids, Opioids, Benzos, Stimulants and RCs.", "details": "Our shop deals in the supply of Cannabinoids, Opioids, Benzos, Stimulants, psychedelics, dissociatives and RCs.\r\n\r\nProduct List\r\n\r\nA) China Warehouse Stock\r\n------------------------\r\nEtomidate / Protonitazene / Metonitazene / Bromazolam / Isotonitazene / Etonitazene\r\nODSMT / 3MethylFent Analogue / Carf Analaogue / APVP / 4MMC / 4CPC / APIHP / METH / 3MMC / 2MMC\r\nEutylone / MDMA / ADBB Precursor / ADBB Full kit / 5cladba precursor / 5cladba full kit / Ketamine\r\n\r\n\r\nB) UK Warehouse Stock\r\n----------------------\r\n5cladba / 5fadb\r\nGreen leaves Cannabinoid (ratio: 1kg green leaves contains 100g 5fadb) (1kg MOQ)\r\nMDMA (Purity 99%) (MOQ 1kg)\r\n\r\n\r\nC) USA Warehouse Stock\r\n------------------------------\r\nAPVP / 2FDCK / MDMA / PMK Liquid\r\n\r\n\r\nD) Mexico Warehouse Stock\r\n-----------------------\r\nPropionyl Chloride\r\n\r\nE) Stock in Germany Warehouse (Ship to Europe except UK)\r\n---------------------------------------------------\r\n1KG PMK Liquid\r\n1KG BMK Powder\r\n10g MDMA Sample\r\n10g APVP Sample\r\n10g 2FDCK Sample\r\nADBB 100g Liquid\r\nADBB 100g powder\r\nADBB main precursor 6kg", "policy": "", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["CN", "GB", "NL", "US"], "ships_to": ["AD", "AE", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_JBvPI7Y.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/SlinginScallywags", "tagline": "Ther be Treasur", "details": "We are the Slingin’ Scallywags, a UK based vendor shipping all around Europe, we can confirm our product is high quality with stealth shipping\r\n\r\nWhat we offer currently:\r\nKetamine S-Isomer Sugar 74%\r\nLSD blotters 220UG\r\n(This list may be updated)\r\n\r\nShipping:\r\nWe ship from uk to every country in the EU, orders can take up to 30 days in a rare case scenario depending which country you are in. Our shipping is FREE and every order will be shipped within 24 hours. However if you place an order before 1pm UK time then it’ll be shipped on the same day. Unfortunately we do not do tracking as it is to risky\r\n\r\nWhen placing an order please do so in this format:\r\n\r\nFirst and last name:\r\nStreet name and number:\r\nPostal code:\r\nCity:\r\nCountry:\r\n\r\nReship policy:\r\n50% reship policy, deliveries to pick up locations such as a PO Box cannot be reshipped\r\nIf you have received the wrong product, 100% reship\r\nIf your order hasn’t arrived within 30 days then we’ll consider your item lost and provide a reship\r\nSame applies for seized items\r\n\r\nWe personally expect our customers to be patient and to know the risks of what they are ordering\r\n\r\nIf you need help with anything or want to request a custom listing for a quantity you desire, please feel free to contact me", "policy": "Orders can take up to 30 days in rare case scenario\r\n\r\nReship Policy:\r\n50% reship policy, deliveries to pick up locations such as PO box cannot be reshipped\r\nIf you have the wrong product, 100% reship\r\nIf your order hasn't arrived within 30 days then we'll consider your item lost and provide a reship\r\nSame applies for seized items", "is_trusted": false, "is_verified": false, "num_reviews": 2, "num_stars": 5, "disputes": null, "ships_from": ["GB"], "ships_to": ["AL", "AM", "AT", "BE", "BG", "BY", "CH", "CY", "CZ", "DE", "DK", "ES", "FI", "FR", "GB", "GE", "GR", "HR", "HU", "IE", "IM", "IS", "IT", "JE", "LI", "LT", "LU", "NL", "NO", "PL", "PT", "RO", "RU", "SE", "UA"], "avatar": "/uploads/avatar_xs6j47t.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/slurrys_cannabis_and_more_store", "tagline": "Great cannabis products for every budget.", "details": "We are slurry, veteran shippers but new to the dark web.\r\nOur products (cannabis products for now) are decent, or terrific, depending on what you purchase, but it will be an honest description and a super fair price!\r\nWe will offer free samples from time to time, tp get new products out to several people! We would like a review on the forums, or at least a thank you and an answer...\r\nWe will try to make your shopping experience great, and we will be adding psychedelics of the highest caliber very soon, even some free samples!", "policy": "PGP or else.\r\nWe know how well the usps does their job, but if they fail to deliver a package we will reship 50% to a new address only, or refund 50%, only if tracking says it got lost.\r\nWe will do whatever it takes to make the client happy... adding extra in the order, etc. Just ask us.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_WFIXNxk.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Stoffland", "tagline": "Fresh Everday", "details": "Wer ist Stoffland?\r\n\r\nWir sind ein professionelles Unternehmen mit strengen Strukturen und Organisation.\r\nBestehend aus einem erfahrenen Team mit hohen Ansprüchen an Qualität und Service.\r\n\r\nWho is Stoffland?\r\n\r\nWe are a professional company with strict structure and organisation.\r\nIncluding a highly experienced Team with expectations for quality and service.", "policy": "***`Versand erfolgt aus Deutschland`***\r\nDer Versand erfolgt bei jeder Bestellung unverzüglich zum nächstmöglichen Zeitpunkt.\r\n**Versanddauer** richtet sich nach **Lieferort**\r\n\r\n#### **Beispiel** \r\n    Finnland 2 Wochen\r\n    UK       1 Woche\r\n    Italien  1 Woche\r\n    DE/AU/CH 3-5 Tage\r\n\r\n\r\n#### ***Das Adressformat bitte wie folgt:***\r\n\r\n    VORNAME NAME\r\n    STRASSE + HAUSNR.\r\n    PLZ + STADT\r\n    BUNDESLAND\r\n    LAND\r\n\r\n---\r\n\r\n***`Shipping from Germany`***\r\nShipment follows every order almost immediately.\r\n**Shipping duration** depends on the **location**\r\n\r\n#### **Example**\r\n    Finland  2 Weeks\r\n    UK       1 Week\r\n    Italy    1 Week\r\n    DE/AU/CH 3-5 Days\r\n\r\n#### ***Adressformat please like this:***\r\n\r\n    NAME SURNAME\r\n    STREET + NUMBER\r\n    POSTAL CODE + CITY\r\n    STATE\r\n    COUNTRY\r\n\r\n---\r\n\r\nErstattung/Refund:\r\n\r\nWir Erstatten ***keine*** Lieferungen bei denen der Fehler nicht bei ***uns*** liegt.\r\nWir behandeln jede Bestellung gleich und gehen Gewissenhaft vor.\r\nWenn Bestellungen nicht ankommen, liegt das nicht in unserer Hand.\r\n\r\n\r\nWe do ***not*** refund orders were ***we*** did not make a mistake.\r\nWe take care of every order the same way and put in the same effort.\r\nIf an order does not arrive, its not in our hands.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["DE"], "ships_to": ["AT", "BA", "BE", "BG", "CH", "CZ", "DE", "DK", "EE", "FI", "FR", "GB", "GR", "HU", "IT", "LI", "LU", "LV", "NL", "NO", "NZ", "PL", "PT", "RO", "RS", "RU", "SE", "TR", "UA"], "avatar": "/uploads/avatar_MWN4wA3.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/SubsRUs", "tagline": "Subs for yu and me", "details": "I only have strips available at the moment. Depending on how this works out i will widen my variety. Thank you.", "policy": "Please use PGP for shipping for both of our security. For now since I only have one product and its so small, I will incur shipping costs.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_xz2Lcam.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Surplus", "tagline": "Top value CAN Cannabis", "details": "Welcome to Surplus Bud\r\n\r\nCanadian vendor offering high quality and extremely competitive pricing to the international market. 150+ orders on Archetyp with almost 100 reviews.\r\n\r\nFocus on bulk sale of flower to worldwide destinations. We ship to most countries if you are unsure if we ship to yours just send us a message!\r\n\r\nTop quality - Fast shipping - Unparalleled stealth\r\nThank you for shopping at Surplus", "policy": "100% reship and finalize upon receiving new tracking\r\nOR\r\n50% Refund", "is_trusted": false, "is_verified": true, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["CA"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_q8VE3MC.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/TarNet", "tagline": "all the most popular drugs in only the highest of quality", "details": "New the vending but extremely experienced in dealings on the DN and DNM, dating back to Agora marketplace. Pictures are of the exact products you'll receive. Stealth is above what has become to be seen as acceptable with other venders. Order with confidence.", "policy": "USA shipping only via priority or first class(safer due to legal protection on FC mail preventing opening). Delivered tracking status means no refund or reship. If you have any complaints message me first before leaving anything less than 5 star feedback. Will reward reviews posted to Dread regardless of if they are positive or negative just send proof once posted.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/ThePartyShop", "tagline": "", "details": "Welcome to: ThePartyShop \r\nYou can also find us on the following markets under the same name etc:\r\nBohemia Market\r\nIncognito Market\r\nTor2door Market\r\nAbacus Market\r\nCypher Market\r\n\r\nMarkets we've vended on: EMPIRE/WHITEHOUSEMARKET/VERSUS/APOLLON/CRYPTONIA/DARKODEREBORN/ASAP/NEPTUNE\r\n\r\nYou can also find us on Recon to see feedback from all markets we've vended on.\r\n\r\nhttp://recon222tttn4ob7ujdhbn3s4gjre7netvzybuvbq2bcqwltkiqinhad.onion/vendor/?results=ThePartyShop\r\n \r\n*****************************************************************\r\nPlease be sure to release escrow once you have received your product and are happy with it any problems do not hesitate to get in touch with us before leaving negative feedback.\r\n*****************************************************************\r\n\r\nWe are available Monday-Friday shipping cut off time is 15:00 GMT so if you place order after the cut off time your order will be sent the following day. \r\nWe will always respond to any messages within 24 hours.\r\n\r\nPlease ensure you send the address format correctly.\r\nE.G.\r\nADDRESS FORMAT:\r\nADDRESS 1\r\nADDRESS 2 \r\nCITY \r\nPOSTCODE \r\n\r\nThank you for your time and we hope you like what we have on offer. Our goal is to keep our customers as happy as possible we have been in the drug trade for well over ten years you won't be disappointed also we will be sure to keep you coming back. What you see in the pictures is exactly what you get.\r\n\r\nPlease use PGP for all sensitive information/have your PGP key displayed for us to message you back.\r\n\r\n**Shipping**\r\nFirst Class 1-3 days \r\n\r\n**Rules**\r\nPlease contact us if your order hasn't arrived within time (standard time + 5 days of delay). \r\n\r\nWe always ship same day Monday till Friday before 3pm (Order Friday before 15:00 and it will go out on Friday) We may ship on Saturday as long as you've placed your order before 11am on Saturday we will try to get it out to you to ensure a Monday delivery.\r\n\r\nOrders made on Saturday after 11am and orders made on Sunday will be shipped on Monday morning - After your order is marked shipped it's been posted!\r\n\r\nWe don't send outside of the UK for now! \r\nNo refunds unless proof of seizure which is unlikely with our stealth only domestic shipping. If you feel your situation isn't covered within these rules get in contact with us to be able to assist you.\r\nOur dropper has proof of every order being sent in the case of a non-arrival, which will then be forwarded to admins if a dispute is opened on any of our orders, to cover our own back, as, once it's been dropped off our job is complete.\r\n**", "policy": "Ship everyday minus Sundays,ORDER BEFORE 15:00GMT/SATURDAY BEFORE 10:00 GMTFOR SAME DAY SHIPPING, \r\n\r\nno reships unless proof of seizure which is very unlikely with only offering domestic shipping and always complimented on our various stealth methods to ensure you receive your order", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["GB"], "ships_to": ["GB"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/TopshopUK", "tagline": "Treat yourself to a little slice of heaven. TopshopUK ultimate party shop for all occasions", "details": "June 16 TOPSHOPUK are now open for business on Drugula market!\r\n\r\nWe are an established vendor on many other sites who pride ourselves on high levels of shipping stealth and top quality products for the party crowd!\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe number one market destination for connoisseurs of the rush.\r\nIf you like late nights chasing a fantastic dream that comes true over and over again you're in the right place.\r\nWe're a bunch of dedicated old school party heads who only take the premium, clean and long-lasting substances ourselves  and we wanted to extend the favor out the faceless millions out there in the crowd.\r\nFor unforgettable parties, mind blowing chem-sex, top nights out, cheeky afternoons in, indulgent holidays away or whatever else you like to get up to\r\nDon't ever settle for anything less than the best make it Top Shop every time.\r\n\r\nCurrent stock:\r\nBolivian Cocaine", "policy": "Reships/Refunds will be dealt with on a case by case basis", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["GB"], "ships_to": ["GB"], "avatar": "/uploads/avatar_eQGjHSB.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/TrapulasCastle", "tagline": "Creatures of the night, welcome", "details": "I'm CountTrapula. I focus on serving crystal, but I've got plenty of other stuff too like Viagra, Adderall, Xanax, and MDMA. Feel free to send me a message if you want something that you don't see listed and I'll see what I can do. Thanks for stopping in", "policy": "100% reship if pack gets lost\r\nNo reship on wrong address", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_Yvs9oUb.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Trippy_Terrapin", "tagline": "Come shake your bones with us", "details": "Hello Trippers! Trippy Terrapin is here to tickle your fancy and shake your bones with a store full of psychedelic treats sure to please. Many of you know that I offer the highest quality products with super stealth shipping from honest and good people promoting higher consciousness and well being. All of my LSD products are of the highest purity from old school family sources and prepared with organically produced alcohol insuring what you receive will be the highest quality. Mushrooms are organically cultivated and Mushroom chocolates are handmade with love and care with Organically grown fair trade vegan dark chocolate. Your purchase supports a vast number of really good people in the supply chain that love you. We also carry ketamine R and S 2cb mdma mda and dmt occasionally", "policy": "Be sure to check out my other listings for more amazing products including LSD Blotter, LSD Liquid, Mushrooms and Mushroom Chocolates. I offer discounts in bulk listings for most products.\r\n\r\nShipping methods:\r\nEasy First Class Mail No Tracking $1\r\nor:\r\nPriority Mail With Tracking $20\r\n\r\nOrders usually shipped the following business day after order is placed and shipped the same day in many cases.\r\n\r\nStealth shipping is high priority!\r\n\r\nTracking Info:\r\nI do not give out tracking info unless a package is late. Please do not ask for tracking info unless your order is late. This is for everyones protection. Thanks for your understanding.\r\n\r\nSHIPPING NOTES:\r\nPlease include correct address in this format if possible:\r\n\r\nFIRST NAME LAST NAME\r\n123 SHAKEDOWN ST APT 420\r\nANYTOWN XX 12345-6969\r\n\r\nCORRECT ADDRESS IS SUPER IMPORTANT AND 4 DIGIT CODE AT END OF THE ZIP CODE IS GOOD TO HAVE. USE REAL FIRST AND LAST NAME. NO ABBREVIATED NAMES.\r\n\r\nPLEASE FINALIZE WHEN RECEIVED SO WE KNOW WE ARE GOOD.\r\n\r\nTHANKS!\r\n\r\nRefund Policy:\r\n\r\nRefunds or re-ships on first class letter un-tracked shipments are done at my discretion.\r\n\r\nRefunds or re-shipments for tracked packages (Priority Mail) will be processed in the event that the tracking shows that the package stops mid-shipment (tracking updates must be idle for several days) or is returned to sender before reaching local receivers PO region if the tracking reveals that the package was delivered or was returned to sender after reaching local PO/attempted delivery then a refund will not be issued.\r\n\r\nIn the event that you are eligible for a re-ship the address must not be compromised.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["AD", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "ER", "ET", "FI", "FJ", "FK", "FO", "FR", "GA", "GE", "GF", "GH", "GI", "GM", "GQ", "GR", "HR", "IO", "KH", "KM", "KY", "PF", "SV", "SZ", "TD", "TF", "UM", "US"], "avatar": "/uploads/avatar_mOBdQM5.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/TrippyTuesdays", "tagline": "We bring High qaulity lab tested products to your door step!", "details": "Whom are we?\r\nWe Are TrippyTuesdays A Team of proffesional well structured and experienced entrepreneurs. As new as our profile may seem we have been doing this for a long time. Given some time and trust we will be one of the best vendors you'll have the pleasure of working with!\r\n\r\nGoal\r\nOur goal is to build long lasting relationships with my customers, structured on honesty, truth, and reliability. I promise to never scam or rip you off and will work very hard to prove that to you!\r\n\r\nRefunds/Reships\r\nRefunds/reships are handled on a case by case basis. No refunds/reships will be issued if the tracking number shows delivered.\r\n\r\nI am not responsible for stolen mail. Make sure your address is safe and you are using the name that matches the rest of the mail coming to that address.\r\n\r\nI will offer a full reship if I made an error that caused the package to not be delivered/RTS.\r\n\r\n-Seizures-\r\nSeized orders can receive a full refund or a full reship (to a new address). Your choice\r\n\r\n-Refunds-\r\nRefunds will only be given if I am out of the product that the buyer ordered.\r\n\r\n-Shipping-\r\nWe Ship 6 days a week, sunday is the day of rest so no business will be handled until the following monday.\r\n\r\n-RTS-\r\nresulting from your lack of ability to provide the correct address and name associated with it, you will not be refunded or reshiped.\r\n\r\n-Tracking-\r\nnumbers are provided only in DISPUTES. I will on the other hand check them for you after 7 business days after marked shipped.\r\n\r\nPlease use the USPS zip code look up tool to get the USPS version of your address\r\n\r\nPlease format your order notes as follows, using your USPS verified address\r\n\r\n*Warning: You MUST use the real name that matches the rest of the mail going to your address. Using a fake name can cause a Return To Sender. No reship/refund will be issued in the case of a RTS due to using a fake name.\r\n\r\nFIRST LAST\r\n123 STREET NAME RD\r\nNy City, NY\r\n10001-4322\r\n\r\n\r\nFeedback\r\nI love to hear feedback! Be assured, I read them all. If for some reason you are not satisfied please reach out to me before leaving bad feedback. Usually, it's a simple mistake or misunderstanding that can be worked out.\r\n\r\nAs always, thank you for your support!", "policy": "READ THIS IN ITS ENTIRETY BEFORE ORDERING\r\n\r\nWhom are we?\r\nWe Are TrippyTuesdays A Team of proffesional well structured and experienced entrepreneurs. As new as our profile may seem we have been doing this for a long time. Given some time and trust we will be one of the best vendors you've have the pleasure of working with!\r\n\r\nGoal\r\nOur goal is to build wonderful relationships with my customers, structured on honesty, truth, and reliability. I promise to never scam or rip you off and will work very hard to prove that to you!\r\n\r\nRefunds/Reships\r\nRefunds/reships are handle on a case by case basis. No refunds/reships will be issued if the tracking number shows delivered, if the package is RTS (due to buyer or USPS errors) and I am unable to intercept it, or any other user faults.\r\n\r\nI am not responsible for stolen mail. Make sure your address is safe and you are using the name that matches the rest of the mail coming to that address.\r\n\r\nFor THC orders, a full reship or refund will be issued if the package tracking has not updated for 15 days since last update\r\n\r\nI will offer a full reship if I made an error that caused the package to not be delivered/RTS.\r\n\r\n-RTS- \r\nresulting from your lack of ability to provide the correct address and name associated with it, will not be refunded or reshiped.\r\n\r\n-Refunds-\r\nRefunds will only be given if I am out of the product that the buyer ordered.\r\n\r\n-Seizures-\r\nSeized orders can receive a full refund or a full reship (to a new address). Your choice\r\n\r\n-Shipping-\r\nWe Ship 6 days a week, sunday is the day of rest so no business will be handled until the following monday.\r\n\r\n-Tracking- \r\nnumbers are provided only in DISPUTES. I will on the other hand check them for you after 7 business days after marked shipped.\r\n\r\nPlease use the USPS zip code look up tool to get the USPS version of your address\r\n\r\nPlease format your order notes as follows, using your USPS verified address\r\n\r\n*Warning: You MUST use the real name that matches the rest of the mail going to your address. Using a fake name can cause a Return To Sender. No reship/refund will be issued in the case of a RTS due to using a fake name.\r\n\r\nFIRST LAST\r\n123 STREET NAME RD\r\nNy City, NY\r\n10001-4322\r\n\r\n\r\nFeedback\r\nI love to hear feedback! Be assured, I read them all. If for some reason you are not satisfied please reach out to me before leaving bad feedback. Usually, it's a simple mistake or misunderstanding that can be worked out.\r\n\r\nAs always, thank you for your support!", "is_trusted": false, "is_verified": true, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_RnEENHw.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Tuckshop", "tagline": "A small mom & pops shop here to provide a THC experience like no other!", "details": "Welcome one welcome all to the Tuckshop!\r\n\r\nTUCKSHOP_SHOPBOT ON TELEGRAM IS NOT US STOP BEING SCAMMED!!!\r\n\r\nABOUT OUR EDIBLES!\r\n\r\nFirst and foremost we are focused on creating ACCURATELY DOSED THC INFUSED EDIBLES\r\n\r\nWe individually dose EACH candy separately so there is 100% no chance your product is underdosed, in fact, if our team thinks they missed a dosing they dose it again for good measure so sometime you may even get an extra powerful edible in your pack!\r\n\r\n\r\n\r\nABOUT OUR CONCENTRATES\r\n\r\n\r\n\r\nProduced in B.C we have some good friends with grows and labs blasting out high quality THC concentrates that we are pleased to be able to share with you all! =)\r\n\r\n\r\n\r\nOur shatter is pure fire, full of terps and a smack to the face in quality, and best of all affordably priced =))\r\n\r\n\r\n\r\nThe Distillate is high quality RAW noncut, it is up to you to add terpenes to it and make your own vape carts, we do not sell Terpenes but you can buy them from such companies as blueriver extracts (USA based) or executiveextracts (UK based).\r\n\r\n\r\n\r\nOur THCA-Diamonds + sauce are a delicious delight when available get it when its in you won't be disappointed. Beautiful diamonds that were coated with GELATO sauce to reintroduce the terpene profile, the diamonds took many months to grow! =)\r\n\r\n\r\n\r\n-----\r\n\r\nSHIPPING INFORMATIONS\r\n\r\n\r\n\r\nWe do try our best to post your order as it comes in, orders placed before 11am will go out same day however orders placed after 12pm there is a chance they will be posted the next day depending on our order volume!\r\n\r\n\r\n\r\nUK-UK 1 - 5 DAYS ON AVG\r\n\r\nUK-EU 7 - 21 DAYS ON AVG\r\n\r\nUK-WW 10 - 36 DAYS ON AVG\r\n\r\n\r\n\r\n0% REFUND/RESHIP FOR NONTRACK MAIL INTERNATIONAL UNLESS SEIZURE NOTICE PROOF\r\n\r\n50% REFUND/RESHIP FOR TRACKED MAIL INTERNATIONALLY\r\n\r\n100% REFUND/RESHIP FOR TRACKED MAIL DOMESTIC", "policy": "100% refund or reship for tracked mail ONLY", "is_trusted": false, "is_verified": true, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["GB"], "ships_to": ["GB"], "avatar": null}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/twohorns_holy_land", "tagline": "PLEASE DO NOT DESECRATE THIS HOLY GROUND ON WHICH U'BOUT TO STEP INTO!!!!", "details": "WE work MON-FRI ONLY\r\n\r\nMake sure you provide full address with receiver name. Format:\r\n\r\nJohn Doe\r\n123 High Street\r\nNew York\r\nNY\r\n12345-6789\r\n\r\nPost code with only first 5 digits is fine\r\nPost code with 9 numbers delivery is faster\r\n\r\nRETURNS:\r\n\r\nonly seized packs can be reshipped or refunded\r\nprovide new address in such case\r\n\r\n\r\nif buyer failed to collect pack or refused it. NO REFUND/RESHIP\r\nif buyer provided wrong address and pack was returned. NO REFUND/RESHIP", "policy": "Q: can i get tracking number?\r\n\r\nA: no we dont provide tracking numbers for securty reasons.\r\nDONT ASK\r\n\r\nQ: i see my order was shipped but i dont see anything on my\r\ninformed delivery\r\n\r\nA: informed delivery is not 100% reliable. sometimes it\r\ndoesnt show\r\n\r\nQ: I see a shipping label was created on informed for the\r\npast 2 days, but nothing shipped.\r\n\r\nA: Thats normal. Your pack was always dropped same day\r\nshipping label created. Sometimes USPS takes up to 3 days to empty Blue boxes.\r\nThere is nothing we can do about this\r\n\r\nQ: i have only 50$ can you make me custom listing?\r\n\r\nA: we dont make any custom listings dont ask. Prices are\r\nfixed!\r\n\r\nQ: i see my order is marked shipped. How long delivery will\r\ntake?\r\n\r\nA: once marked shipped order will arrive within 5 business\r\ndays\r\n\r\nQ: do i need to sign for delivery\r\n\r\nA: no signature is not required\r\n\r\nQ: Can you ship outside USA and Canada?\r\n\r\nA: NO\r\n\r\nQ: Can you ship by FEDEX or UPS?\r\n\r\nA: NO\r\n\r\nQ: Can you ship on Weekend?\r\n\r\nA: NO\r\n\r\nQ: Do you ship to PO Boxes?\r\n\r\nA: Yes", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["CA", "US"], "ships_to": ["CA", "US"], "avatar": "/uploads/avatar_l9q9VC2.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/WeedstarTHC", "tagline": "UKs #1 Dispensary", "details": "Happy 2023 BIG WS love to you all of you.\r\n\r\nBIG UPDATE to our ALL NEW SUPPORT admin and NEW online team.\r\n\r\nJAN 2023 - NEW STEALTH GENERIC BRANDED PACKAGING :) No mention of THC, No QR codes, Carts Now shipped in tubes. Please see our bulk prices info as well.\r\n---\r\nGamma LSD micro Tabs and Magic Mushrooms available now, both dried and in Caps, ready for microdosing.\r\n\r\n***TRACKING NUMBERS ARE NOW ADDED WHEN ITEM IS SENT***\r\n\r\nWeedStar are one of the UKs best loved and trusted Dark Net vendors\r\n\r\n!ORDERING FROM WEEDSTAR!\r\n\r\nWe are online 6 Days a week\r\n\r\nWe ship until 2PM Mon - Saturday\r\n\r\n1st Class\r\nSigned for\r\nSpecial Delivery NDD 1PM.\r\n\r\nAll shipping is done with discretion and stealth.\r\n\r\nWe will reship or refund orders that don't arrive.\r\n\r\n!Now in Stock!\r\n\r\nTHC / CBD Cannabis Tinctures\r\nUK THC Edibles\r\nUK THC Vape Carts (50:50 and 70:30 Distillate:Live Resin)\r\nMicrodose LSD Tabs\r\nMicrodose Mushroom Capsules\r\n\r\n!STRAINS!\r\nAmnesia OG\r\nPremium OG\r\nZkittlez\r\nRuntz\r\nGorilla Glue\r\nXJ13\r\nCannatonic\r\nBubblegum AK\r\nOriginal AK\r\nWedding Cake\r\nGirl Scout Cookies\r\nRAW\r\nWSD Banana Goo Pie\r\nWSD Amnesia OG\r\nOriginal UK Cheese\r\nOriginal Sensi Skunk\r\nOriginal White Widow\r\n\r\n!EXTRACTS INFO!\r\nTHC Distillate 95 THC\r\nLiveResin & Shatter\r\nNo PGPEGVGMCT\r\nNo Delta 8 this is all over the UK be aware", "policy": "Refund or replace ( reship offered on non arrival )", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["GB"], "ships_to": ["GB"], "avatar": "/uploads/avatar_UbIFVm4.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Wombat", "tagline": ": High purity drugs : Low prices : Fast delivery : Excellent stealth :", "details": "WOMBAT\r\n\r\n::: High purity drugs :::\r\n::: Low prices :::\r\n::: Fast delivery :::\r\n::: Excellent stealth :::\r\n\r\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::\r\n\r\nEncrypt your drop address and details.\r\n\r\nAddress format is\r\n\r\nPaul Smith\r\n32 Main Street\r\nBOWDEN SA 5007\r\n\r\nYour shipment information is not stored.\r\n\r\nNotify us if the product does not arrive and we will reship! We want you to get your drugs and get high! We will still provide enthusiastic positive feedback, but we will respectfully mention the anomaly in the feedback for the sale to deter abuse of our reship policy. Negative feedback will be met with negative feedback and receive no further communication. Let's get the problem sorted out.\r\n\r\nSome notes on OPSEC. Generally speaking, mailing small amounts drugs domestically in Australia is relatively safe. For personal amounts you are pretty safe to just get them delivered to your home. If, for some very unusual and rare reason, Australia Post or the Police became aware of the package, for personal quantities, they would simply dispose of the product and move on. It's not worth their time to pursue small quantities.\r\n\r\nWhether you write your own name or another name on the mail doesn't really matter in my opinion. I would er on the side of writing another name if it doesn't matter that the people I live with see a letter arrive with an usual name. But it's also ok to just use your own name if there's people you live with who are not aware that you are buying drugs.\r\n\r\nAny and all inquiries are welcome.\r\n\r\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::\r\n\r\nHARM REDUCTION INFORMATION\r\n\r\nIf you're providing drugs to others, take the time to teach them how to use them responsibly. Even better, follow up with them after they've taken the drug.\r\n\r\nThe drugs we sell can have some detrimental effects on your physical health, mental health and well-being. This isn't eating an apple or meditating. There are real positive benefits to taking drugs, and there's actual real risks too. Investigate and learn how to use them safely. Just take it slowly and look after yourself.\r\n\r\nTell your buddies you're getting high, what you're taking, and how much you're taking. If you're taking numerous doses or drugs, keep track of how long each dose lasts and how much you take each time.\r\n\r\nStart low, go slow.\r\n\r\nIf you're in trouble, I recommend calling the following phone numbers.\r\n\r\nLifeline: 13 11 14\r\nMensline Australia: 1300 78 99 78\r\n\r\nHere are the mental health crisis phone numbers for each state.\r\n\r\n* ACT: 1800 629 354 — Mental Health Triage Service\r\n* NSW: 1800 011 511 — Mental Health Line\r\n* NT: 1800 682 288 — Northern Territory Mental Health Line\r\n* QLD: 1300 642255 — 24-hour specialist mental healthcare\r\n* SA: 13 14 65 — Mental Health Triage Service\r\n* TAS: 1800 332 388 — Mental Health Service Helpline\r\n* VIC: 1300 60 60 24 - Nurse-on-call\r\n* WA: 1800 676 822 — Mental Health Emergency Response Line\r\n\r\nBest advice though, if you've taken drugs, and you're freaking out, give it 48 hours and you'll probably be fine.\r\n\r\nFinal point. Medical professionals will not dob you into the Police. If you were to call 000 your health and well being is their only priority.", "policy": "Notify us if the product does not arrive and we will reship. We will still provide enthusiastic positive feedback, but we will respectfully mention the anomaly in the feedback for the sale to deter abuse of our reship policy. \r\n\r\nNegative feedback will receive no further communication or interaction.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["AU"], "ships_to": ["AU"], "avatar": "/uploads/avatar_hmcj7o6.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/yodiweed", "tagline": "Flowers and concentrates with a high level of Thc", "details": "Flowers and concentrates with a high level of Thc and Terpens, grown indoors in France with a very very good quality level witch tick all the boxes, a well developed organic products with a pleasant value for money.\r\n\r\nThe photos are from the current production, what is ordered will be received, perfect stealth and uncompressed buds.\r\n\r\nI thank those who take the time to write a feedback, really appreciate.", "policy": "My shipping method is fast, not revealing the content on hand manipulations and odorless.\r\n\r\nWelcome destination: Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland, including Liechtenstein, San Marino, Vatican, Africa, North America, Central America, South America, the Caribbean, the Middle East, the Near East, Asia and Oceania.\r\n\r\nIn case of problems, just send a message.\r\n\r\nExpected address as below:\r\n\r\n    Unit 42, Land of Bargains Shopping Paradise\r\n    12 Highway 101\r\n    Boston\r\n    MA, USA\r\n\r\nIndicate the name as it is on the mailbox.", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["FR"], "ships_to": ["AD", "AE", "AF", "AG", "AI", "AL", "AM", "AO", "AQ", "AR", "AS", "AT", "AU", "AW", "AX", "AZ", "BA", "BB", "BD", "BE", "BF", "BG", "BH", "BI", "BJ", "BL", "BM", "BN", "BO", "BQ", "BR", "BS", "BT", "BV", "BW", "BY", "BZ", "CA", "CC", "CD", "CF", "CG", "CH", "CI", "CK", "CL", "CM", "CN", "CO", "CR", "CU", "CV", "CW", "CX", "CY", "CZ", "DE", "DJ", "DK", "DM", "DO", "DZ", "EC", "EE", "EG", "EH", "ER", "ES", "ET", "FI", "FJ", "FK", "FM", "FO", "FR", "GA", "GB", "GD", "GE", "GF", "GG", "GH", "GI", "GL", "GM", "GN", "GP", "GQ", "GR", "GS", "GT", "GU", "GW", "GY", "HK", "HM", "HN", "HR", "HT", "HU", "ID", "IE", "IL", "IM", "IN", "IO", "IQ", "IR", "IS", "IT", "JE", "JM", "JO", "JP", "KE", "KG", "KH", "KI", "KM", "KN", "KP", "KR", "KW", "KY", "KZ", "LA", "LB", "LC", "LI", "LK", "LR", "LS", "LT", "LU", "LV", "LY", "MA", "MC", "MD", "ME", "MF", "MG", "MH", "MK", "ML", "MM", "MN", "MO", "MP", "MQ", "MR", "MS", "MT", "MU", "MV", "MW", "MX", "MY", "MZ", "NA", "NC", "NE", "NF", "NG", "NI", "NL", "NO", "NP", "NR", "NU", "NZ", "OM", "PA", "PE", "PF", "PG", "PH", "PK", "PL", "PM", "PN", "PR", "PS", "PT", "PW", "PY", "QA", "RE", "RO", "RS", "RU", "RW", "SA", "SB", "SC", "SD", "SE", "SG", "SH", "SI", "SJ", "SK", "SL", "SM", "SN", "SO", "SR", "SS", "ST", "SV", "SX", "SY", "SZ", "TC", "TD", "TF", "TG", "TH", "TJ", "TK", "TL", "TM", "TN", "TO", "TR", "TT", "TV", "TW", "TZ", "UA", "UG", "UM", "US", "UY", "UZ", "VA", "VC", "VE", "VG", "VI", "VN", "VU", "WF", "WS", "YE", "YT", "ZA", "ZM", "ZW"], "avatar": "/uploads/avatar_I8c2qO2.jpg"}, {"link": "http://drugula44brpin5w2xk6j3adll35pp3zdihqqkndhg336j55pwdtufyd.onion/v/Zenzedi", "tagline": "What Adderall wishes it was", "details": "`Hello and welcome. I'm a new vendor, but I do have 3 successful sales on Dark Matter Market with all positive reviews. I hope you'll take a chance - this product is as legit as it gets! Please message me with any questions or concerns.`\r\n\r\n---\r\n\r\n!!!Currently running a Grand Opening Sale through July! !!!\r\n\r\n---\r\n\r\nWelcome to this little shop. I have one item only: the most premium form of amphetamine on the market today.\r\n\r\nAdderall is 75% dextroamphetamine and 25% levoamphetamine. Levoamphetamine is garbage and unfit for human consumption. Here you will find 10 mg brand name, pharmaceutical dextroamphetamine. Its effect is so much smoother, more enjoyable, and more useful than Adderall.\r\n\r\nCheck out my listing for more info!", "policy": "I appreciate your business and hope to make your experience one of the best on the darknet.\r\n\r\nAll packages will shipped within 24 hours of order confirmation via USPS Flat Rate Priority Mail, and arrive 2-3 business days after shipping. I do my best to confirm and ship as soon as humanly possible :) \r\n\r\nPlease remember to finalize the order once you have received it.\r\n\r\nTracking numbers are not provided unless there is an issue with the order. Refunds cannot be given if tracking indicates that the package was delivered.\r\n\r\n**Always use the full name (no initials!) of a real, current resident at the shipping address. Refunds cannot be given if this important step is not followed.**\r\n\r\nThank you!", "is_trusted": false, "is_verified": false, "num_reviews": 0, "num_stars": null, "disputes": null, "ships_from": ["US"], "ships_to": ["US"], "avatar": "/uploads/avatar_VU7sAmx.jpg"}]}